readme.org
#+TITLE: Deploying a Web App with AWS, Terraform, Cloud-init, Ansible and Jenkins
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
#+EXPORT_FILE_NAME: index.html
See: https://edhilgendorf.github.io/tf-ans/
* The project
Project is to use this repository ( and possibly a couple others ) to build and deploy a web application using some core technologies:
** Technologies used
*** DONE AWS for cloud housting
- [[*Configure AWS][Configure AWS]]
*** DONE GitHub to host code, configs, and static site: https://edhilgendorf.github.io/tf-ans/
*** DONE Terraform Cloud ( free ) to handle state and Terrafrom deployments upon check-in with GitHub
- [[*Configure Terraform Cloud][Configure Terraform Cloud]]
*** Terraform to provision AWS
 + [[#-create-infrastructure-with-terraform-][Create Infrastructure with Terraform]]
*** TODO Cloud-init for any VMs
 + [[*Bootstrap EC2 with cloud-init][Bootstrap EC2 with cloud-init]]
*** Ansible for config management
+ [[*Configuration Management with Ansible][Configuration Management with Ansible]] on [[#-create-infrastructure-with-terraform-ecs-for-awx-][ECS for AWX]]
*** Jenkins to deploy the application
+ An application /(TBD)/ inside a Docker Container
+ Ansible to Deploy Kubernetes
