index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-10-12 Tue 16:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Deploying a Web App with AWS, Terraform, Cloud-init, Ansible and Jenkins</title>
<meta name="author" content="edward" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Deploying a Web App with AWS, Terraform, Cloud-init, Ansible and Jenkins</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd68565e">1. The project</a>
<ul>
<li><a href="#orgbdfbf27">1.1. Technologies used/steps</a>
<ul>
<li><a href="#org6b0eb70">1.1.1. <span class="done DONE">DONE</span> AWS for cloud housting</a></li>
<li><a href="#orgac48dc8">1.1.2. <span class="done DONE">DONE</span> GitHub to host code, configs, and static site: https://edhilgendorf.github.io/tf-ans/</a></li>
<li><a href="#org278fd9a">1.1.3. <span class="done DONE">DONE</span> Terraform Cloud ( free ) to handle state and Terrafrom deployments upon check-in with GitHub</a></li>
<li><a href="#org0c224cc">1.1.4. Terraform to provision AWS</a></li>
<li><a href="#orga018d81">1.1.5. <span class="todo TODO">TODO</span> Cloud-init for any VMs</a></li>
<li><a href="#orgbf1a458">1.1.6. Ansible for config management, hosted on</a></li>
<li><a href="#org0b6f260">1.1.7. Jenkins to deploy the application ECS for AWX</a></li>
</ul>
</li>
<li><a href="#orgbadf6e7">1.2. This Document</a></li>
<li><a href="#orgfd8a3eb">1.3. Links</a></li>
<li><a href="#org97c8fae">1.4. Challenges</a></li>
<li><a href="#org3cd3617">1.5. Conventions&#xa0;&#xa0;&#xa0;<span class="tag"><span class="conventions">conventions</span></span></a>
<ul>
<li><a href="#org548f7ad">1.5.1. Code Example</a></li>
<li><a href="#org266f6ea">1.5.2. File structure</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org42ff60f">2. Install Terraform&#xa0;&#xa0;&#xa0;<span class="tag"><span class="terraform">terraform</span>&#xa0;<span class="install">install</span></span></a></li>
<li><a href="#org49485aa">3. Install Packer &#x2013; (Unused in this project, at this time)&#xa0;&#xa0;&#xa0;<span class="tag"><span class="packer">packer</span>&#xa0;<span class="install">install</span></span></a></li>
<li><a href="#orgf7ac4ff">4. Configure AWS&#xa0;&#xa0;&#xa0;<span class="tag"><span class="aws">aws</span></span></a>
<ul>
<li><a href="#orgfc102e1">4.1. Setup AWS CLI&#xa0;&#xa0;&#xa0;<span class="tag"><span class="cli">cli</span>&#xa0;<span class="install">install</span></span></a></li>
<li><a href="#org4255609">4.2. Use AWS CLI&#xa0;&#xa0;&#xa0;<span class="tag"><span class="cli">cli</span></span></a></li>
<li><a href="#-configure-aws-create-iam-user-and-policies-">4.3. Create IAM User and Policies&#xa0;&#xa0;&#xa0;<span class="tag"><span class="iam">iam</span></span></a>
<ul>
<li><a href="#org680318c">4.3.1. IAM Terraform User <span class="underline">start</span>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="policy">policy</span></span></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org40af7ed">5. Configure Terraform Cloud&#xa0;&#xa0;&#xa0;<span class="tag"><span class="cloud">cloud</span>&#xa0;<span class="terraform_cloud">terraform_cloud</span></span></a>
<ul>
<li><a href="#orga0c1132">5.1. ./terraform/backend.tf</a></li>
</ul>
</li>
<li><a href="#-create-infrastructure-with-terraform-">6. Create Infrastructure with Terraform&#xa0;&#xa0;&#xa0;<span class="tag"><span class="terraform">terraform</span>&#xa0;<span class="iac">iac</span></span></a>
<ul>
<li><a href="#org0c02e78">6.1. Configure Providers</a>
<ul>
<li><a href="#org63c9229">6.1.1. ./terraform/providers.tf</a></li>
</ul>
</li>
<li><a href="#org22a2152">6.2. Create variables&#xa0;&#xa0;&#xa0;<span class="tag"><span class="variables">variables</span></span></a>
<ul>
<li><a href="#orge3cb1c9">6.2.1. ./terraform/variables.tf</a></li>
</ul>
</li>
<li><a href="#org9998023">6.3. Create a network&#xa0;&#xa0;&#xa0;<span class="tag"><span class="network">network</span></span></a>
<ul>
<li><a href="#org7263c86">6.3.1. Create VPCs&#xa0;&#xa0;&#xa0;<span class="tag"><span class="vpc">vpc</span></span></a></li>
<li><a href="#org40f1aa6">6.3.2. Create IGWs&#xa0;&#xa0;&#xa0;<span class="tag"><span class="igw">igw</span></span></a></li>
<li><a href="#orgd6580f6">6.3.3. Provide Data&#xa0;&#xa0;&#xa0;<span class="tag"><span class="data">data</span></span></a></li>
<li><a href="#org5c46a18">6.3.4. Create Subnets in our VPCs&#xa0;&#xa0;&#xa0;<span class="tag"><span class="subnet">subnet</span></span></a></li>
<li><a href="#org3e3ef58">6.3.5. Create Peering between VPCs&#xa0;&#xa0;&#xa0;<span class="tag"><span class="peering">peering</span></span></a></li>
<li><a href="#org6c1efe2">6.3.6. Create Routing in and between VPCs&#xa0;&#xa0;&#xa0;<span class="tag"><span class="route">route</span>&#xa0;<span class="vpc">vpc</span></span></a></li>
<li><a href="#org02f0909">6.3.7. Create Security Groups&#xa0;&#xa0;&#xa0;<span class="tag"><span class="security_groups">security_groups</span></span></a></li>
</ul>
</li>
<li><a href="#orge72d2a5">6.4. Create IAM Role for EC2 Access&#xa0;&#xa0;&#xa0;<span class="tag"><span class="ec2">ec2</span>&#xa0;<span class="iam">iam</span></span></a>
<ul>
<li><a href="#org9d855b8">6.4.1. ./terraform/iam.tf&#xa0;&#xa0;&#xa0;<span class="tag"><span class="aws_iam_role">aws_iam_role</span></span></a></li>
<li><a href="#orgb73ba76">6.4.2. ./terraform/iam.tf&#xa0;&#xa0;&#xa0;<span class="tag"><span class="aws_iam_instance_profile">aws_iam_instance_profile</span></span></a></li>
<li><a href="#org0a4a01f">6.4.3. ./terraform/iam.tf&#xa0;&#xa0;&#xa0;<span class="tag"><span class="aws_iam_role_policy">aws_iam_role_policy</span></span></a></li>
</ul>
</li>
<li><a href="#orge00f99d">6.5. Create Instances</a>
<ul>
<li><a href="#org58d0f3b">6.5.1. Get AMIs&#xa0;&#xa0;&#xa0;<span class="tag"><span class="ami">ami</span>&#xa0;<span class="vm">vm</span></span></a></li>
<li><a href="#orgfc3d56d">6.5.2. Set cloud-init Scripts</a></li>
<li><a href="#org72efbb0">6.5.3. Configure SSH keypairs for AMI VMs&#xa0;&#xa0;&#xa0;<span class="tag"><span class="keypair">keypair</span></span></a></li>
<li><a href="#org0947e7f">6.5.4. Create EC2 Instances&#xa0;&#xa0;&#xa0;<span class="tag"><span class="ec2">ec2</span></span></a></li>
</ul>
</li>
<li><a href="#-create-infrastructure-with-terraform-s3-">6.6. S3&#xa0;&#xa0;&#xa0;<span class="tag"><span class="s3">s3</span></span></a>
<ul>
<li><a href="#org38c889a">6.6.1. ./terraform/s3.tf&#xa0;&#xa0;&#xa0;<span class="tag"><span class="aws_s3">aws_s3</span></span></a></li>
</ul>
</li>
<li><a href="#org5cbfaa9">6.7. Create EFS&#xa0;&#xa0;&#xa0;<span class="tag"><span class="efs">efs</span></span></a>
<ul>
<li><a href="#org54d1ffc">6.7.1. ./terraform/efs.tf</a></li>
</ul>
</li>
<li><a href="#-create-infrastructure-with-terraform-ecs-for-awx-">6.8. ECS for AWX&#xa0;&#xa0;&#xa0;<span class="tag"><span class="awx">awx</span>&#xa0;<span class="ecs">ecs</span></span></a>
<ul>
<li><a href="#org78580b2">6.8.1. ./terraform/ecs.tf</a></li>
</ul>
</li>
<li><a href="#org3bec491">6.9. Create Outputs&#xa0;&#xa0;&#xa0;<span class="tag"><span class="output">output</span></span></a>
<ul>
<li><a href="#orgddeaf1d">6.9.1. ./terraform/outputs.tf&#xa0;&#xa0;&#xa0;<span class="tag"><span class="outputs">outputs</span></span></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org413d071">7. Bootstrap EC2 with cloud-init&#xa0;&#xa0;&#xa0;<span class="tag"><span class="cloud_init">cloud_init</span></span></a>
<ul>
<li><a href="#orgd40da37">7.1. ./terraform/scripts/cloud-init.yaml&#xa0;&#xa0;&#xa0;<span class="tag"><span class="cloudinit">cloudinit</span>&#xa0;<span class="script">script</span></span></a></li>
<li><a href="#org1049a0d">7.2. ./terraform/scripts/cloud-init.yaml&#xa0;&#xa0;&#xa0;<span class="tag"><span class="cloudinit">cloudinit</span>&#xa0;<span class="script">script</span></span></a></li>
</ul>
</li>
<li><a href="#org40fa15b">8. Configuration Management with Ansible&#xa0;&#xa0;&#xa0;<span class="tag"><span class="ansible">ansible</span></span></a>
<ul>
<li><a href="#orgc902780">8.1. <del>Getting AWS Credentials to Ansible</del> This is best configured by attaching a role to the EC2 instance, done here: Create IAM Role for EC2 Access</a>
<ul>
<li><a href="#orgbc4eb52">8.1.1. ./terraform/sync-aws-creds.sh</a></li>
</ul>
</li>
<li><a href="#org187efda">8.2. Dynamic Inventory&#xa0;&#xa0;&#xa0;<span class="tag"><span class="dynamic_inventory">dynamic_inventory</span></span></a>
<ul>
<li><a href="#orga0eb763">8.2.1. ../ansible-cloud/ansible.cfg</a></li>
<li><a href="#org0ab71f4">8.2.2. ../ansible-cloud/aws_ec2.yml</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#-iam-terraform-user--end--">9. IAM Terraform User <span class="underline">end</span>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="policy_end">policy_end</span></span></a></li>
<li><a href="#org8e84a1a">10. Useful Commands</a></li>
<li><a href="#org0aa524b">11. Troubleshooting&#xa0;&#xa0;&#xa0;<span class="tag"><span class="troubleshooting">troubleshooting</span></span></a>
<ul>
<li><a href="#org1d729cc">11.1. Encoded Messages&#xa0;&#xa0;&#xa0;<span class="tag"><span class="sts">sts</span>&#xa0;<span class="error">error</span></span></a></li>
<li><a href="#org9f96f6e">11.2. Unrelated Errors&#xa0;&#xa0;&#xa0;<span class="tag"><span class="error">error</span>&#xa0;<span class="region">region</span></span></a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
See: <a href="https://edhilgendorf.github.io/tf-ans/">https://edhilgendorf.github.io/tf-ans/</a>
</p>
<div id="outline-container-orgd68565e" class="outline-2">
<h2 id="orgd68565e"><span class="section-number-2">1</span> The project</h2>
<div class="outline-text-2" id="text-1">
<p>
Project is to use this repository ( and possibly a couple others ) to build and deploy a web application using some core technologies:
</p>
</div>
<div id="outline-container-orgbdfbf27" class="outline-3">
<h3 id="orgbdfbf27"><span class="section-number-3">1.1</span> Technologies used/steps</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org6b0eb70" class="outline-4">
<h4 id="org6b0eb70"><span class="section-number-4">1.1.1</span> <span class="done DONE">DONE</span> AWS for cloud housting</h4>
<div class="outline-text-4" id="text-1-1-1">
<ul class="org-ul">
<li><a href="#orgf7ac4ff">Configure AWS</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgac48dc8" class="outline-4">
<h4 id="orgac48dc8"><span class="section-number-4">1.1.2</span> <span class="done DONE">DONE</span> GitHub to host code, configs, and static site: <a href="https://edhilgendorf.github.io/tf-ans/">https://edhilgendorf.github.io/tf-ans/</a></h4>
</div>
<div id="outline-container-org278fd9a" class="outline-4">
<h4 id="org278fd9a"><span class="section-number-4">1.1.3</span> <span class="done DONE">DONE</span> Terraform Cloud ( free ) to handle state and Terrafrom deployments upon check-in with GitHub</h4>
<div class="outline-text-4" id="text-1-1-3">
<ul class="org-ul">
<li><a href="#org40af7ed">Configure Terraform Cloud</a></li>
</ul>
</div>
</div>
<div id="outline-container-org0c224cc" class="outline-4">
<h4 id="org0c224cc"><span class="section-number-4">1.1.4</span> Terraform to provision AWS</h4>
<div class="outline-text-4" id="text-1-1-4">
<ul class="org-ul">
<li><a href="#-create-infrastructure-with-terraform-">Create Infrastructure with Terraform</a></li>
</ul>
</div>
</div>
<div id="outline-container-orga018d81" class="outline-4">
<h4 id="orga018d81"><span class="section-number-4">1.1.5</span> <span class="todo TODO">TODO</span> Cloud-init for any VMs</h4>
<div class="outline-text-4" id="text-1-1-5">
<ul class="org-ul">
<li><a href="#org413d071">Bootstrap EC2 with cloud-init</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgbf1a458" class="outline-4">
<h4 id="orgbf1a458"><span class="section-number-4">1.1.6</span> Ansible for config management, hosted on</h4>
<div class="outline-text-4" id="text-1-1-6">
<ul class="org-ul">
<li><a href="#org40fa15b">Configuration Management with Ansible</a> on <a href="#-create-infrastructure-with-terraform-ecs-for-awx-">ECS for AWX</a></li>
</ul>
</div>
</div>
<div id="outline-container-org0b6f260" class="outline-4">
<h4 id="org0b6f260"><span class="section-number-4">1.1.7</span> Jenkins to deploy the application <a href="#-create-infrastructure-with-terraform-ecs-for-awx-">ECS for AWX</a></h4>
<div class="outline-text-4" id="text-1-1-7">
<ul class="org-ul">
<li>An application <i>(TBD)</i> inside a Docker Container</li>
<li>Ansible to Deploy Kubernetes</li>
</ul>
</div>
</div>
</div>
