readme.org
** This Document
Documentation and code are built into this same [[https://orgmode.org/][orgmode]] document. All the code in this repository is created from snippets in this document via org-tangle. The process is as follows:
1. Create a new bullet point/update old one
2. Add ~PROPERTIES~ under the bullet to specify file to either ammend or create
3. Run ~org-bable-tangle~ (within Emacs). This extracts all code blocks and builds code files
4. /optional/ Apply any necessary formatting, ex: ~terraform fmt~
5. Check in and push changes. This document and corresponding repositories *should* be VCS driven, with changes applied after successful Git commit/push.
The purpose of this is to build a cloud based project using IaC that explains *why* each step is done, as well as *how*, all in one place. See this document in plain text, here: [[https://raw.githubusercontent.com/edhilgendorf/tf-ans/main/readme.org][readme.org]]
** Links
- [[https://github.com/edhilgendorf/tf-ans][Terraform Project Repository]]
- [[https://github.com/edhilgendorf/ansible-cloud][Ansible Project Repository]]
- [[https://edhilgendorf.github.io/tf-ans/][Read the docs]]
- [[https://hilgendorf.me][hilgendorf.me]]
** Challenges
- Secrets :: The idea is this entire document and project are available so anyone can see how it is setup and the output at the end. This means no plaintext passwords and having to be carefeul with key-pairs.
- VCS Driven from Terraform Cloud :: This has been the most difficult. I have seen before, and do not want to end up with a situation where you have to run Bash/etc scripts from different locations to get to the required end-state, so I decided to use VCS as "single source of truth" and have all Terraform deployed from Terraform Cloud. This rules out a lot of things: using Terraform outputs in Ansible/etc scripts, as well as using local provisioners. That being said, Terraform recommends against local-exec provisioners so I think it's a good step, regardless.
** Conventions :conventions:
*** Code Example :example:
- Each block will be named as above
- Following will be bullet points with an explanation and /hopefully/ a link to the corresponding resource
**** [[./terraform/example_code.py]] <-- the file that will be "tangled", see [[*This Document][This Document]]
:PROPERTIES:
:header-args: :tangle terraform/example_code.py
:END:
- This prints "hello world" to the user on execution
  #+begin_src python
print ("hello world")
print("1")
  #+end_src
*** File structure
- Since Terraform runs are repo driven, anytime an update hits it will queue up a run. In order to save money on AWS, and lower the number of runs, create a working directory in Terraform Cloud, then relocate all Terraform code to that directory.
  + https://www.terraform.io/docs/cloud/workspaces/settings.html
- It is then possible to trigger runs only on working directories
- This also prevents Terraform kicking off when I am only updating this documentation.
- Real file structure will look like this:
  #+begin_src
.
├── ansible-cloud
│   ├── ansible.cfg
│   ├── inventory
│   └── README.md
└── terraform-cloud
    ├── example_code.py
    ├── index.html
    ├── readme.org
    └── terraform
  #+end_src
  + This structure is rigid as I may want to experiment getting outputs from Terraform into Ansible. But I don't think this is best practice (to be done locally) as Git checkouts/clones can vary by user. I think one solution is a Git submodule, or just using terraform ~local-exec~ to clone in place, but as mentioned in [[https://www.terraform.io/docs/language/resources/provisioners/local-exec.html][local-exec provisioner documentation]] it is a last resort.
* Install Terraform :terraform:install:
https://www.terraform.io/downloads.html
* Install Packer -- (Unused in this project, at this time) :packer:install:
#+begin_src bash
curl -fsSL https://apt.releases.hashicorp.com/gpg | sudo apt-key add -
sudo apt-add-repository "deb [arch=amd64] https://apt.releases.hashicorp.com $(lsb_release -cs) main"
sudo apt-get update && sudo apt-get install packer
#+end_src
* Configure AWS :aws:
- Register account: https://portal.aws.amazon.com/gp/aws/developer/registration/index.html
** Setup AWS CLI :cli:install:
- https://docs.aws.amazon.com/cli/latest/userguide/install-cliv2-linux.html
** Use AWS CLI :cli:
** Create IAM User and Policies :iam:
:PROPERTIES:
:CUSTOM_ID: -configure-aws-create-iam-user-and-policies-
:END:
- IAM: https://console.aws.amazon.com/iam/home
- Polcies: https://console.aws.amazon.com/iamv2/home?#/policiesC
- IAM User: https://console.aws.amazon.com/iam/home#/users$new?step=details
  + programmatic (non-console)
  + attach existing policy
- Add user to ~/.aws/credentials~ as a profile:
 #+begin_src
 [default]
 aws_access_key=<your_key>
 aws_secret_access_key=<your_key>

 [tf_user]
 aws_access_key=<your_key>
 aws_secret_access_key=<your_key>
 #+end_src
- Add root user as default, or create IAM admin:
  https://console.aws.amazon.com/iam/home?region=us-east-1#/security_credentials$access_key
*** IAM Terraform User _start_ :policy:
