index.html
<div id="outline-container-orgbadf6e7" class="outline-3">
<h3 id="orgbadf6e7"><span class="section-number-3">1.2</span> This Document</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Documentation and code are built into this same <a href="https://orgmode.org/">orgmode</a> document. All the code in this repository is created from snippets in this document via org-tangle. The process is as follows:
</p>
<ol class="org-ol">
<li>Create a new bullet point/update old one</li>
<li>Add <code>PROPERTIES</code> under the bullet to specify file to either ammend or create</li>
<li>Run <code>org-bable-tangle</code> (within Emacs). This extracts all code blocks and builds code files</li>
<li><i>optional</i> Apply any necessary formatting, ex: <code>terraform fmt</code></li>
<li>Check in and push changes. This document and corresponding repositories <b>should</b> be VCS driven, with changes applied after successful Git commit/push.</li>
</ol>
<p>
The purpose of this is to build a cloud based project using IaC that explains <b>why</b> each step is done, as well as <b>how</b>, all in one place. See this document in plain text, here: <a href="https://raw.githubusercontent.com/edhilgendorf/tf-ans/main/readme.org">readme.org</a>
</p>
</div>
</div>
<div id="outline-container-orgfd8a3eb" class="outline-3">
<h3 id="orgfd8a3eb"><span class="section-number-3">1.3</span> Links</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li><a href="https://github.com/edhilgendorf/tf-ans">Terraform Project Repository</a></li>
<li><a href="https://github.com/edhilgendorf/ansible-cloud">Ansible Project Repository</a></li>
<li><a href="https://edhilgendorf.github.io/tf-ans/">Read the docs</a></li>
<li><a href="https://hilgendorf.me">hilgendorf.me</a></li>
</ul>
</div>
</div>
<div id="outline-container-org97c8fae" class="outline-3">
<h3 id="org97c8fae"><span class="section-number-3">1.4</span> Challenges</h3>
<div class="outline-text-3" id="text-1-4">
<dl class="org-dl">
<dt>Secrets</dt><dd>The idea is this entire document and project are available so anyone can see how it is setup and the output at the end. This means no plaintext passwords and having to be carefeul with key-pairs.</dd>
<dt>VCS Driven from Terraform Cloud</dt><dd>This has been the most difficult. I have seen before, and do not want to end up with a situation where you have to run Bash/etc scripts from different locations to get to the required end-state, so I decided to use VCS as &ldquo;single source of truth&rdquo; and have all Terraform deployed from Terraform Cloud. This rules out a lot of things: using Terraform outputs in Ansible/etc scripts, as well as using local provisioners. That being said, Terraform recommends against local-exec provisioners so I think it&rsquo;s a good step, regardless.</dd>
</dl>
</div>
</div>
<div id="outline-container-org3cd3617" class="outline-3">
<h3 id="org3cd3617"><span class="section-number-3">1.5</span> Conventions&#xa0;&#xa0;&#xa0;<span class="tag"><span class="conventions">conventions</span></span></h3>
<div class="outline-text-3" id="text-1-5">
</div>
<div id="outline-container-org548f7ad" class="outline-4">
<h4 id="org548f7ad"><span class="section-number-4">1.5.1</span> Code Example</h4>
<div class="outline-text-4" id="text-1-5-1">
<ul class="org-ul">
<li>Each block will be named as above</li>
<li>Following will be bullet points with an explanation and <i>hopefully</i> a link to the corresponding resource</li>
</ul>
</div>
<ol class="org-ol">
<li><a id="org458eead"></a><a href="./terraform/example_code.py">./terraform/example_code.py</a> &lt;&#x2013; the file that will be &ldquo;tangled&rdquo;, see <a href="#orgbadf6e7">This Document</a><br />
<div class="outline-text-5" id="text-1-5-1-1">
<ul class="org-ul">
<li><p>
This prints &ldquo;hello world&rdquo; to the user on execution
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #51afef;">print</span> (<span style="color: #98be65;">"hello world"</span>)
<span style="color: #51afef;">print</span>(<span style="color: #98be65;">"1"</span>)
</pre>
</div></li>
</ul>
</div>
</li>
</ol>
</div>
<div id="outline-container-org266f6ea" class="outline-4">
<h4 id="org266f6ea"><span class="section-number-4">1.5.2</span> File structure</h4>
<div class="outline-text-4" id="text-1-5-2">
<ul class="org-ul">
<li>Since Terraform runs are repo driven, anytime an update hits it will queue up a run. In order to save money on AWS, and lower the number of runs, create a working directory in Terraform Cloud, then relocate all Terraform code to that directory.
<ul class="org-ul">
<li><a href="https://www.terraform.io/docs/cloud/workspaces/settings.html">https://www.terraform.io/docs/cloud/workspaces/settings.html</a></li>
</ul></li>
<li>It is then possible to trigger runs only on working directories</li>
<li>This also prevents Terraform kicking off when I am only updating this documentation.</li>
<li><p>
Real file structure will look like this:
</p>
<pre class="example">
.
├── ansible-cloud
│   ├── ansible.cfg
│   ├── inventory
│   └── README.md
└── terraform-cloud
    ├── example_code.py
    ├── index.html
    ├── readme.org
    └── terraform
</pre>
<ul class="org-ul">
<li>This structure is rigid as I may want to experiment getting outputs from Terraform into Ansible. But I don&rsquo;t think this is best practice (to be done locally) as Git checkouts/clones can vary by user. I think one solution is a Git submodule, or just using terraform <code>local-exec</code> to clone in place, but as mentioned in <a href="https://www.terraform.io/docs/language/resources/provisioners/local-exec.html">local-exec provisioner documentation</a> it is a last resort.</li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-org42ff60f" class="outline-2">
<h2 id="org42ff60f"><span class="section-number-2">2</span> Install Terraform&#xa0;&#xa0;&#xa0;<span class="tag"><span class="terraform">terraform</span>&#xa0;<span class="install">install</span></span></h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="https://www.terraform.io/downloads.html">https://www.terraform.io/downloads.html</a>
</p>
</div>
</div>
<div id="outline-container-org49485aa" class="outline-2">
<h2 id="org49485aa"><span class="section-number-2">3</span> Install Packer &#x2013; (Unused in this project, at this time)&#xa0;&#xa0;&#xa0;<span class="tag"><span class="packer">packer</span>&#xa0;<span class="install">install</span></span></h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #ECBE7B;">curl</span> -fsSL https://apt.releases.hashicorp.com/gpg | <span style="color: #ECBE7B;">sudo</span> apt-key add -
<span style="color: #ECBE7B;">sudo</span> apt-add-repository <span style="color: #98be65;">"deb [arch=amd64] https://apt.releases.hashicorp.com </span><span style="color: #51afef; font-weight: bold;">$(</span><span style="color: #51afef; font-weight: bold;">lsb_release</span><span style="color: #51afef; font-weight: bold;"> -cs)</span><span style="color: #98be65;"> main"</span>
<span style="color: #ECBE7B;">sudo</span> apt-get update &amp;&amp; <span style="color: #ECBE7B;">sudo</span> apt-get install packer
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf7ac4ff" class="outline-2">
<h2 id="orgf7ac4ff"><span class="section-number-2">4</span> Configure AWS&#xa0;&#xa0;&#xa0;<span class="tag"><span class="aws">aws</span></span></h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>Register account: <a href="https://portal.aws.amazon.com/gp/aws/developer/registration/index.html">https://portal.aws.amazon.com/gp/aws/developer/registration/index.html</a></li>
</ul>
</div>
<div id="outline-container-orgfc102e1" class="outline-3">
<h3 id="orgfc102e1"><span class="section-number-3">4.1</span> Setup AWS CLI&#xa0;&#xa0;&#xa0;<span class="tag"><span class="cli">cli</span>&#xa0;<span class="install">install</span></span></h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li><a href="https://docs.aws.amazon.com/cli/latest/userguide/install-cliv2-linux.html">https://docs.aws.amazon.com/cli/latest/userguide/install-cliv2-linux.html</a></li>
</ul>
</div>
</div>
<div id="outline-container-org4255609" class="outline-3">
<h3 id="org4255609"><span class="section-number-3">4.2</span> Use AWS CLI&#xa0;&#xa0;&#xa0;<span class="tag"><span class="cli">cli</span></span></h3>
</div>
<div id="outline-container--configure-aws-create-iam-user-and-policies-" class="outline-3">
<h3 id="-configure-aws-create-iam-user-and-policies-"><span class="section-number-3">4.3</span> Create IAM User and Policies&#xa0;&#xa0;&#xa0;<span class="tag"><span class="iam">iam</span></span></h3>
<div class="outline-text-3" id="text--configure-aws-create-iam-user-and-policies-">
<ul class="org-ul">
<li>IAM: <a href="https://console.aws.amazon.com/iam/home">https://console.aws.amazon.com/iam/home</a></li>
<li>Polcies: <a href="https://console.aws.amazon.com/iamv2/home?#/policiesC">https://console.aws.amazon.com/iamv2/home?#/policiesC</a></li>
<li>IAM User: <a href="https://console.aws.amazon.com/iam/home#/users$new?step=details">https://console.aws.amazon.com/iam/home#/users$new?step=details</a>
<ul class="org-ul">
<li>programmatic (non-console)</li>
<li>attach existing policy</li>
</ul></li>
<li><p>
Add user to <code>/.aws/credentials</code> as a profile:
</p>
<pre class="example">
 [default]
 aws_access_key=&lt;your_key&gt;
 aws_secret_access_key=&lt;your_key&gt;

 [tf_user]
 aws_access_key=&lt;your_key&gt;
 aws_secret_access_key=&lt;your_key&gt;
</pre></li>
<li>Add root user as default, or create IAM admin:
<a href="https://console.aws.amazon.com/iam/home?region=us-east-1#/security_credentials$access_key">https://console.aws.amazon.com/iam/home?region=us-east-1#/security_credentials$access_key</a></li>
</ul>
</div>
<div id="outline-container-org680318c" class="outline-4">
<h4 id="org680318c"><span class="section-number-4">4.3.1</span> IAM Terraform User <span class="underline">start</span>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="policy">policy</span></span></h4>
<div class="outline-text-4" id="text-4-3-1">
<p>
<a href="./terraform/policies/terraform_user.json">./terraform/policies/terraform_user.json</a>
</p>
<ul class="org-ul">
