index.html
<li>this is very much a WIP, and some of these are <b>wide</b> open, such as IAM while working through issues.</li>
<li>I am splitting this up so that each terraform module used get&rsquo;s it&rsquo;s IAM actions in the same bullet point/section.</li>
<li>See <a href="#-iam-terraform-user--end--">IAM Terraform User <span class="underline">end</span></a></li>
</ul>
<div class="org-src-container">
<pre class="src src-json">{
  <span style="color: #51afef;">"Version"</span>: "<span style="color: #da8548; font-weight: bold;">2012</span>-<span style="color: #da8548; font-weight: bold;">10</span>-<span style="color: #da8548; font-weight: bold;">17</span>",
  <span style="color: #51afef;">"Statement"</span>: [
    {
      <span style="color: #51afef;">"Sid"</span>: <span style="color: #98be65;">"CustomPolicyForACGAWSTFCourse"</span>,
      <span style="color: #51afef;">"Action"</span>: [
        <span style="color: #98be65;">"ec2:Describe*"</span>,
        <span style="color: #98be65;">"ec2:Get*"</span>,
        <span style="color: #98be65;">"ec2:AcceptVpcPeeringConnection"</span>,
        <span style="color: #98be65;">"ec2:AttachInternetGateway"</span>,
        <span style="color: #98be65;">"ec2:AssociateRouteTable"</span>,
        <span style="color: #98be65;">"ec2:AssociateIamInstanceProfile"</span>,
        <span style="color: #98be65;">"ec2:AuthorizeSecurityGroupEgress"</span>,
        <span style="color: #98be65;">"ec2:AuthorizeSecurityGroupIngress"</span>,
        <span style="color: #98be65;">"ec2:CreateInternetGateway"</span>,
        <span style="color: #98be65;">"ec2:CreateNetworkAcl"</span>,
        <span style="color: #98be65;">"ec2:CreateNetworkAclEntry"</span>,
        <span style="color: #98be65;">"ec2:CreateRoute"</span>,
        <span style="color: #98be65;">"ec2:CreateRouteTable"</span>,
        <span style="color: #98be65;">"ec2:CreateSecurityGroup"</span>,
        <span style="color: #98be65;">"ec2:CreateSubnet"</span>,
        <span style="color: #98be65;">"ec2:CreateTags"</span>,
        <span style="color: #98be65;">"ec2:CreateVpc"</span>,
        <span style="color: #98be65;">"ec2:CreateVpcPeeringConnection"</span>,
        <span style="color: #98be65;">"ec2:DeleteNetworkAcl"</span>,
        <span style="color: #98be65;">"ec2:DeleteNetworkAclEntry"</span>,
        <span style="color: #98be65;">"ec2:DeleteRoute"</span>,
        <span style="color: #98be65;">"ec2:DeleteRouteTable"</span>,
        <span style="color: #98be65;">"ec2:DeleteSecurityGroup"</span>,
        <span style="color: #98be65;">"ec2:DeleteSubnet"</span>,
        <span style="color: #98be65;">"ec2:DeleteTags"</span>,
        <span style="color: #98be65;">"ec2:DeleteVpc"</span>,
        <span style="color: #98be65;">"ec2:DeleteVpcPeeringConnection"</span>,
        <span style="color: #98be65;">"ec2:DetachInternetGateway"</span>,
        <span style="color: #98be65;">"ec2:DisassociateRouteTable"</span>,
        <span style="color: #98be65;">"ec2:DisassociateSubnetCidrBlock"</span>,
        <span style="color: #98be65;">"ec2:CreateKeyPair"</span>,
        <span style="color: #98be65;">"ec2:DeleteKeyPair"</span>,
        <span style="color: #98be65;">"ec2:DeleteInternetGateway"</span>,
        <span style="color: #98be65;">"ec2:ImportKeyPair"</span>,
        <span style="color: #98be65;">"ec2:ModifySubnetAttribute"</span>,
        <span style="color: #98be65;">"ec2:ModifyVpcAttribute"</span>,
        <span style="color: #98be65;">"ec2:ModifyVpcPeeringConnectionOptions"</span>,
        <span style="color: #98be65;">"ec2:RejectVpcPeeringConnection"</span>,
        <span style="color: #98be65;">"ec2:ReplaceNetworkAclAssociation"</span>,
        <span style="color: #98be65;">"ec2:ReplaceNetworkAclEntry"</span>,
        <span style="color: #98be65;">"ec2:ReplaceRoute"</span>,
        <span style="color: #98be65;">"ec2:ReplaceRouteTableAssociation"</span>,
        <span style="color: #98be65;">"ec2:RevokeSecurityGroupEgress"</span>,
        <span style="color: #98be65;">"ec2:RevokeSecurityGroupIngress"</span>,
        <span style="color: #98be65;">"ec2:RunInstances"</span>,
        <span style="color: #98be65;">"ec2:TerminateInstances"</span>,
        <span style="color: #98be65;">"ec2:UpdateSecurityGroupRuleDescriptionsEgress"</span>,
        <span style="color: #98be65;">"ec2:UpdateSecurityGroupRuleDescriptionsIngress"</span>,
        <span style="color: #98be65;">"acm:*"</span>,
        <span style="color: #98be65;">"elasticloadbalancing:AddListenerCertificates"</span>,
        <span style="color: #98be65;">"elasticloadbalancing:AddTags"</span>,
        <span style="color: #98be65;">"elasticloadbalancing:CreateListener"</span>,
        <span style="color: #98be65;">"elasticloadbalancing:CreateLoadBalancer"</span>,
        <span style="color: #98be65;">"elasticloadbalancing:CreateRule"</span>,
        <span style="color: #98be65;">"elasticloadbalancing:CreateTargetGroup"</span>,
        <span style="color: #98be65;">"elasticloadbalancing:DeleteListener"</span>,
        <span style="color: #98be65;">"elasticloadbalancing:DeleteLoadBalancer"</span>,
        <span style="color: #98be65;">"elasticloadbalancing:DeleteRule"</span>,
        <span style="color: #98be65;">"elasticloadbalancing:DeleteTargetGroup"</span>,
        <span style="color: #98be65;">"elasticloadbalancing:DeregisterTargets"</span>,
        <span style="color: #98be65;">"elasticloadbalancing:DescribeListenerCertificates"</span>,
        <span style="color: #98be65;">"elasticloadbalancing:DescribeListeners"</span>,
        <span style="color: #98be65;">"elasticloadbalancing:DescribeLoadBalancerAttributes"</span>,
        <span style="color: #98be65;">"elasticloadbalancing:DescribeLoadBalancers"</span>,
        <span style="color: #98be65;">"elasticloadbalancing:DescribeRules"</span>,
        <span style="color: #98be65;">"elasticloadbalancing:DescribeSSLPolicies"</span>,
        <span style="color: #98be65;">"elasticloadbalancing:DescribeTags"</span>,
        <span style="color: #98be65;">"elasticloadbalancing:DescribeTargetGroupAttributes"</span>,
        <span style="color: #98be65;">"elasticloadbalancing:DescribeTargetGroups"</span>,
        <span style="color: #98be65;">"elasticloadbalancing:DescribeTargetHealth"</span>,
        <span style="color: #98be65;">"elasticloadbalancing:ModifyListener"</span>,
        <span style="color: #98be65;">"elasticloadbalancing:ModifyLoadBalancerAttributes"</span>,
        <span style="color: #98be65;">"elasticloadbalancing:ModifyRule"</span>,
        <span style="color: #98be65;">"elasticloadbalancing:ModifyTargetGroup"</span>,
        <span style="color: #98be65;">"elasticloadbalancing:ModifyTargetGroupAttributes"</span>,
        <span style="color: #98be65;">"elasticloadbalancing:RegisterTargets"</span>,
        <span style="color: #98be65;">"elasticloadbalancing:RemoveListenerCertificates"</span>,
        <span style="color: #98be65;">"elasticloadbalancing:RemoveTags"</span>,
        <span style="color: #98be65;">"elasticloadbalancing:SetSecurityGroups"</span>,
        <span style="color: #98be65;">"elasticloadbalancing:SetSubnets"</span>,
        <span style="color: #98be65;">"route53:Get*"</span>,
        <span style="color: #98be65;">"route53:List*"</span>,
        <span style="color: #98be65;">"route53:ChangeResourceRecordSets"</span>,
        <span style="color: #98be65;">"ssm:Describe*"</span>,
        <span style="color: #98be65;">"ssm:GetParameter"</span>,
        <span style="color: #98be65;">"ssm:GetParameters"</span>,
        <span style="color: #98be65;">"ssm:GetParametersByPath"</span>,
        <span style="color: #98be65;">"s3:CreateBucket"</span>,
        <span style="color: #98be65;">"s3:*"</span>,
        <span style="color: #98be65;">"s3:DeleteBucket"</span>,
        <span style="color: #98be65;">"s3:DeleteObject"</span>,
        <span style="color: #98be65;">"s3:GetBucketLocation"</span>,
        <span style="color: #98be65;">"s3:GetObject"</span>,
        <span style="color: #98be65;">"s3:HeadBucket"</span>,
        <span style="color: #98be65;">"s3:ListBucket"</span>,
        <span style="color: #98be65;">"iam:*"</span>,
        <span style="color: #98be65;">"s3:PutObject"</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-org40af7ed" class="outline-2">
<h2 id="org40af7ed"><span class="section-number-2">5</span> Configure Terraform Cloud&#xa0;&#xa0;&#xa0;<span class="tag"><span class="cloud">cloud</span>&#xa0;<span class="terraform_cloud">terraform_cloud</span></span></h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>Regsiter account: <a href="https://app.terraform.io/signup/account?utm_source=terraform_io&amp;utm_content=terraform_cloud_top_nav">https://app.terraform.io/signup/account?utm_source=terraform_io&amp;utm_content=terraform_cloud_top_nav</a></li>
<li>Create an organization</li>
<li>Create a Workspace from VCS Repository, ex: <a href="https://github.com">https://github.com</a></li>
<li>Create a token and save in <code>~/.terraform.d/credentials.tfrc.json</code>
<ul class="org-ul">
<li><a href="https://app.terraform.io/app/settings/tokens">https://app.terraform.io/app/settings/tokens</a></li>
</ul></li>
<li>Add access keys to Terraform Cloud
<ul class="org-ul">
<li><a href="https://app.terraform.io/app/">https://app.terraform.io/app/</a>&lt;organization&gt;/workspaces/&lt;workspace&gt;/variables</li>
</ul></li>
<li>Initialize your environment <code>terraform init</code></li>
<li>Configure Terraform Cloud to plan and apply upon check-in
<ul class="org-ul">
<li><a href="https://app.terraform.io/app/">https://app.terraform.io/app/</a>&lt;your<sub>org</sub>&gt;/workspaces/&lt;your<sub>workspace</sub>&gt;/settings/general</li>
</ul></li>
<li>setup a backend remote pointing to your org/workspace</li>
</ul>
</div>
<div id="outline-container-orga0c1132" class="outline-3">
<h3 id="orga0c1132"><span class="section-number-3">5.1</span> <a href="./terraform/backend.tf">./terraform/backend.tf</a></h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">
<pre class="src src-json">terraform {
  backend <span style="color: #98be65;">"remote"</span> {
    organization = <span style="color: #98be65;">"hilgendorfdotme"</span>
    workspaces {
      name = <span style="color: #98be65;">"tf-ans"</span>
    }
  }
}
</pre>
</div>
</div>
</div>
</div>
