readme.org
* Create Infrastructure with Terraform :terraform:iac:
:PROPERTIES:
:CUSTOM_ID: -create-infrastructure-with-terraform-
:END:
** Configure Providers
*** [[./terraform/providers.tf]]
:PROPERTIES:
:header-args: :tangle terraform/providers.tf
:END:
#+begin_src json
provider "aws" {
  #profile = var.profile
  region = var.region-master
  alias  = "region-master"
}

provider "aws" {
  #profile = var.profile
  region = var.region-worker
  alias  = "region-worker"
}
#+end_src
** Create variables :variables:
- Input variables serve as parameters for a Terraform module, allowing aspects of the module to be customized without altering the module's own source code, and allowing modules to be shared between different configurations.
  + https://www.terraform.io/docs/language/values/variables.html
*** [[./terraform/variables.tf]]
:PROPERTIES:
:header-args: :tangle terraform/variables.tf
:END:
- profile and default user
- two regions
  - a master region (us-east-1)
  - a worker region (us-west-2)
- external ip (yours)
- workers count (how many instances to create)
- instance type when deploying EC2
- a URL for our Ansible repo so we can clone it
- set IAM policy for EC2 Full access, this will be used for Ansible [[*Dynamic Inventory][Dynamic Inventory]]
#+begin_src json
variable "profile" {
  type    = string
  default = "tf_user"
}
variable "region-master" {
  type    = string
  default = "us-east-1"
}
variable "region-worker" {
  type    = string
  default = "us-west-2"
}
variable "test" {
  type    = string
  default = "catheadbiscuit"
}
#Replace with <YOUR_EXTERNAL_IP>  https://ipv4.icanhazip.com
variable "external_ip" {
  type    = string
  default = "0.0.0.0/0"
}
variable "workers-count" {
  type    = number
  default = 1
}
variable "instance-type" {
  type    = string
  default = "t3.micro"
}
variable "ansible-git" {
  type    = string
  default = "https://github.com/edhilgendorf/ansible-cloud.git"
}
variable "iam_policy_ec2_full_arn" {
  description = "IAM Policy for full EC2"
  type = string
  default = "arn:aws:iam::aws:policy/AmazonEC2FullAccess"
}
#+end_src
** Create a network :network:
*** Create VPCs :vpc:
- A virtual network dedicated to your AWS account.
  + https://docs.aws.amazon.com/vpc/latest/userguide/what-is-amazon-vpc.html
**** [[./terraform/network.tf]]
:PROPERTIES:
:header-args: :tangle terraform/network.tf
:END:
+ VPCs
  - *vpc_master*
    + deploy in us-east-1
    + give network 10.0.0.0/16
    + enable dns and hostnames
    + tag this as ~master-vpc-devops~
  - *vpc_master_oregon*
    + deploy in us-west-2
    + give network 192.168.0.0/16
    + enable dns and hostnames
    + tag as ~worker-vpc-devops~
+ Variables come from: [[*Create variables][Create variables]]
#+begin_src json
#Create VPC in us-east-1
resource "aws_vpc" "vpc_master" {
  provider             = aws.region-master
  cidr_block           = "10.0.0.0/16"
  enable_dns_support   = true
  enable_dns_hostnames = true
  tags = {
    Name = "master-vpc-devops"
  }
}
#Create VPC in us-west-2
resource "aws_vpc" "vpc_master_oregon" {
  provider             = aws.region-worker
  cidr_block           = "192.168.0.0/16"
  enable_dns_support   = true
  enable_dns_hostnames = true
  tags = {
    Name = "worker-vpc-devops"
  }
}
  #+end_src
*** Create IGWs :igw:
- An internet gateway is a horizontally scaled, redundant, and highly available VPC component that allows communication between your VPC and the internet.
  + https://docs.aws.amazon.com/vpc/latest/userguide/VPC_Internet_Gateway.html
**** [[./terraform/network.tf]]
:PROPERTIES:
:header-args: :tangle terraform/network.tf
:END:
+ create an internet gateway in each VPC, which reside in different availability zones (us-east-1 and us-west-2)
#+begin_src json
#Create IGW in us-east-1
resource "aws_internet_gateway" "igw" {
  provider = aws.region-master
  vpc_id   = aws_vpc.vpc_master.id
}
#Create IGW in us-west-2
resource "aws_internet_gateway" "igw-oregon" {
  provider = aws.region-worker
  vpc_id   = aws_vpc.vpc_master_oregon.id
}
#+end_src
*** Provide Data :data:
- Data sources allow Terraform use information defined outside of Terraform, defined by another separate Terraform configuration, or modified by functions.
  + https://www.terraform.io/docs/language/data-sources/index.html
**** [[./terraform/network.tf]]
  :PROPERTIES:
  :header-args: :tangle terraform/network.tf
  :END:
  + get ~aws_availability_zones~ that are in ~state: available~
  #+begin_src json
#get all available AZs in VPC for master
data "aws_availability_zones" "azs" {
  provider = aws.region-master
  state    = "available"
}
  #+end_src
