index.html
<div id="outline-container--create-infrastructure-with-terraform-" class="outline-2">
<h2 id="-create-infrastructure-with-terraform-"><span class="section-number-2">6</span> Create Infrastructure with Terraform&#xa0;&#xa0;&#xa0;<span class="tag"><span class="terraform">terraform</span>&#xa0;<span class="iac">iac</span></span></h2>
<div class="outline-text-2" id="text--create-infrastructure-with-terraform-">
</div>
<div id="outline-container-org0c02e78" class="outline-3">
<h3 id="org0c02e78"><span class="section-number-3">6.1</span> Configure Providers</h3>
<div class="outline-text-3" id="text-6-1">
</div>
<div id="outline-container-org63c9229" class="outline-4">
<h4 id="org63c9229"><span class="section-number-4">6.1.1</span> <a href="./terraform/providers.tf">./terraform/providers.tf</a></h4>
<div class="outline-text-4" id="text-6-1-1">
<div class="org-src-container">
<pre class="src src-json">provider <span style="color: #98be65;">"aws"</span> {
  #profile = var.profile
  region = var.region-master
  alias  = <span style="color: #98be65;">"region-master"</span>
}

provider <span style="color: #98be65;">"aws"</span> {
  #profile = var.profile
  region = var.region-worker
  alias  = <span style="color: #98be65;">"region-worker"</span>
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org22a2152" class="outline-3">
<h3 id="org22a2152"><span class="section-number-3">6.2</span> Create variables&#xa0;&#xa0;&#xa0;<span class="tag"><span class="variables">variables</span></span></h3>
<div class="outline-text-3" id="text-6-2">
<ul class="org-ul">
<li>Input variables serve as parameters for a Terraform module, allowing aspects of the module to be customized without altering the module&rsquo;s own source code, and allowing modules to be shared between different configurations.
<ul class="org-ul">
<li><a href="https://www.terraform.io/docs/language/values/variables.html">https://www.terraform.io/docs/language/values/variables.html</a></li>
</ul></li>
</ul>
</div>
<div id="outline-container-orge3cb1c9" class="outline-4">
<h4 id="orge3cb1c9"><span class="section-number-4">6.2.1</span> <a href="./terraform/variables.tf">./terraform/variables.tf</a></h4>
<div class="outline-text-4" id="text-6-2-1">
<ul class="org-ul">
<li>profile and default user</li>
<li>two regions
<ul class="org-ul">
<li>a master region (us-east-1)</li>
<li>a worker region (us-west-2)</li>
</ul></li>
<li>external ip (yours)</li>
<li>workers count (how many instances to create)</li>
<li>instance type when deploying EC2</li>
<li>a URL for our Ansible repo so we can clone it</li>
<li>set IAM policy for EC2 Full access, this will be used for Ansible <a href="#org187efda">Dynamic Inventory</a></li>
</ul>
<div class="org-src-container">
<pre class="src src-json">variable <span style="color: #98be65;">"profile"</span> {
  type    = string
  default = <span style="color: #98be65;">"tf_user"</span>
}
variable <span style="color: #98be65;">"region-master"</span> {
  type    = string
  default = "us-east-<span style="color: #da8548; font-weight: bold;">1</span>"
}
variable <span style="color: #98be65;">"region-worker"</span> {
  type    = string
  default = "us-west-<span style="color: #da8548; font-weight: bold;">2</span>"
}
variable <span style="color: #98be65;">"test"</span> {
  type    = string
  default = <span style="color: #98be65;">"catheadbiscuit"</span>
}
#Replace with &lt;YOUR_EXTERNAL_IP&gt;  https://ipv<span style="color: #a9a1e1;">4</span>.icanhazip.com
variable <span style="color: #98be65;">"external_ip"</span> {
  type    = string
  default = "<span style="color: #da8548; font-weight: bold;">0.0</span>.<span style="color: #da8548; font-weight: bold;">0.0</span>/<span style="color: #da8548; font-weight: bold;">0</span>"
}
variable <span style="color: #98be65;">"workers-count"</span> {
  type    = number
  default = <span style="color: #da8548; font-weight: bold;">1</span>
}
variable <span style="color: #98be65;">"instance-type"</span> {
  type    = string
  default = <span style="color: #98be65;">"t3.micro"</span>
}
variable <span style="color: #98be65;">"ansible-git"</span> {
  type    = string
  default = <span style="color: #98be65;">"https://github.com/edhilgendorf/ansible-cloud.git"</span>
}
variable <span style="color: #98be65;">"iam_policy_ec2_full_arn"</span> {
  description = <span style="color: #98be65;">"IAM Policy for full EC2"</span>
  type = string
  default = <span style="color: #98be65;">"arn:aws:iam::aws:policy/AmazonEC2FullAccess"</span>
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org9998023" class="outline-3">
<h3 id="org9998023"><span class="section-number-3">6.3</span> Create a network&#xa0;&#xa0;&#xa0;<span class="tag"><span class="network">network</span></span></h3>
<div class="outline-text-3" id="text-6-3">
</div>
<div id="outline-container-org7263c86" class="outline-4">
<h4 id="org7263c86"><span class="section-number-4">6.3.1</span> Create VPCs&#xa0;&#xa0;&#xa0;<span class="tag"><span class="vpc">vpc</span></span></h4>
<div class="outline-text-4" id="text-6-3-1">
<ul class="org-ul">
<li>A virtual network dedicated to your AWS account.
<ul class="org-ul">
<li><a href="https://docs.aws.amazon.com/vpc/latest/userguide/what-is-amazon-vpc.html">https://docs.aws.amazon.com/vpc/latest/userguide/what-is-amazon-vpc.html</a></li>
</ul></li>
</ul>
</div>
<ol class="org-ol">
<li><a id="orgcec0b79"></a><a href="./terraform/network.tf">./terraform/network.tf</a><br />
<div class="outline-text-5" id="text-6-3-1-1">
<ul class="org-ul">
<li>VPCs
<ul class="org-ul">
<li><b>vpc<sub>master</sub></b>
<ul class="org-ul">
<li>deploy in us-east-1</li>
<li>give network 10.0.0.0/16</li>
<li>enable dns and hostnames</li>
<li>tag this as <code>master-vpc-devops</code></li>
</ul></li>
<li><b>vpc<sub>master</sub><sub>oregon</sub></b>
<ul class="org-ul">
<li>deploy in us-west-2</li>
<li>give network 192.168.0.0/16</li>
<li>enable dns and hostnames</li>
<li>tag as <code>worker-vpc-devops</code></li>
</ul></li>
</ul></li>
<li>Variables come from: <a href="#org22a2152">Create variables</a></li>
</ul>
<div class="org-src-container">
<pre class="src src-json">#Create VPC in us-east-<span style="color: #da8548; font-weight: bold;">1</span>
resource <span style="color: #98be65;">"aws_vpc"</span> <span style="color: #98be65;">"vpc_master"</span> {
  provider             = aws.region-master
  cidr_block           = "<span style="color: #da8548; font-weight: bold;">10.0</span>.<span style="color: #da8548; font-weight: bold;">0.0</span>/<span style="color: #da8548; font-weight: bold;">16</span>"
  enable_dns_support   = <span style="color: #a9a1e1;">true</span>
  enable_dns_hostnames = <span style="color: #a9a1e1;">true</span>
  tags = {
    Name = <span style="color: #98be65;">"master-vpc-devops"</span>
  }
}
#Create VPC in us-west-<span style="color: #da8548; font-weight: bold;">2</span>
resource <span style="color: #98be65;">"aws_vpc"</span> <span style="color: #98be65;">"vpc_master_oregon"</span> {
  provider             = aws.region-worker
  cidr_block           = "<span style="color: #da8548; font-weight: bold;">192.168</span>.<span style="color: #da8548; font-weight: bold;">0.0</span>/<span style="color: #da8548; font-weight: bold;">16</span>"
  enable_dns_support   = <span style="color: #a9a1e1;">true</span>
  enable_dns_hostnames = <span style="color: #a9a1e1;">true</span>
  tags = {
    Name = <span style="color: #98be65;">"worker-vpc-devops"</span>
  }
}
</pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-org40f1aa6" class="outline-4">
<h4 id="org40f1aa6"><span class="section-number-4">6.3.2</span> Create IGWs&#xa0;&#xa0;&#xa0;<span class="tag"><span class="igw">igw</span></span></h4>
<div class="outline-text-4" id="text-6-3-2">
<ul class="org-ul">
<li>An internet gateway is a horizontally scaled, redundant, and highly available VPC component that allows communication between your VPC and the internet.
<ul class="org-ul">
<li><a href="https://docs.aws.amazon.com/vpc/latest/userguide/VPC_Internet_Gateway.html">https://docs.aws.amazon.com/vpc/latest/userguide/VPC_Internet_Gateway.html</a></li>
</ul></li>
</ul>
</div>
<ol class="org-ol">
<li><a id="org1721921"></a><a href="./terraform/network.tf">./terraform/network.tf</a><br />
<div class="outline-text-5" id="text-6-3-2-1">
<ul class="org-ul">
<li>create an internet gateway in each VPC, which reside in different availability zones (us-east-1 and us-west-2)</li>
</ul>
<div class="org-src-container">
<pre class="src src-json">#Create IGW in us-east-<span style="color: #da8548; font-weight: bold;">1</span>
resource <span style="color: #98be65;">"aws_internet_gateway"</span> <span style="color: #98be65;">"igw"</span> {
  provider = aws.region-master
  vpc_id   = aws_vpc.vpc_master.id
}
#Create IGW in us-west-<span style="color: #da8548; font-weight: bold;">2</span>
resource <span style="color: #98be65;">"aws_internet_gateway"</span> <span style="color: #98be65;">"igw-oregon"</span> {
  provider = aws.region-worker
  vpc_id   = aws_vpc.vpc_master_oregon.id
}
</pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-orgd6580f6" class="outline-4">
<h4 id="orgd6580f6"><span class="section-number-4">6.3.3</span> Provide Data&#xa0;&#xa0;&#xa0;<span class="tag"><span class="data">data</span></span></h4>
<div class="outline-text-4" id="text-6-3-3">
<ul class="org-ul">
<li>Data sources allow Terraform use information defined outside of Terraform, defined by another separate Terraform configuration, or modified by functions.
<ul class="org-ul">
<li><a href="https://www.terraform.io/docs/language/data-sources/index.html">https://www.terraform.io/docs/language/data-sources/index.html</a></li>
</ul></li>
</ul>
</div>
<ol class="org-ol">
<li><a id="org2bd4efe"></a><a href="./terraform/network.tf">./terraform/network.tf</a><br />
<div class="outline-text-5" id="text-6-3-3-1">
<ul class="org-ul">
<li>get <code>aws_availability_zones</code> that are in <code>state: available</code></li>
</ul>
<div class="org-src-container">
<pre class="src src-json">#get all available AZs in VPC for master
data <span style="color: #98be65;">"aws_availability_zones"</span> <span style="color: #98be65;">"azs"</span> {
  provider = aws.region-master
  state    = <span style="color: #98be65;">"available"</span>
}
</pre>
</div>
</div>
</li>
</ol>
</div>
