index.html
<div id="outline-container-org5c46a18" class="outline-4">
<h4 id="org5c46a18"><span class="section-number-4">6.3.4</span> Create Subnets in our VPCs&#xa0;&#xa0;&#xa0;<span class="tag"><span class="subnet">subnet</span></span></h4>
<div class="outline-text-4" id="text-6-3-4">
<ul class="org-ul">
<li>When you create a VPC, you must specify a range of IPv4 addresses for the VPC in the form of a Classless Inter-Domain Routing (CIDR) block; for example, 10.0.0.0/16. This is the primary CIDR block for your VPC. For more information about CIDR notation, see RFC 4632.
<ul class="org-ul">
<li><a href="https://docs.aws.amazon.com/vpc/latest/userguide/VPC_Subnets.html">https://docs.aws.amazon.com/vpc/latest/userguide/VPC_Subnets.html</a></li>
</ul></li>
</ul>
</div>
<ol class="org-ol">
<li><a id="org1cafdc3"></a><a href="./terraform/network.tf">./terraform/network.tf</a><br />
<div class="outline-text-5" id="text-6-3-4-1">
<ul class="org-ul">
<li>two subnets in the master VPC defined in <a href="#org7263c86">Create VPCs</a>.
<ul class="org-ul">
<li><code>10.0.1.0/24</code></li>
<li><code>10.0.2.0/24</code></li>
</ul></li>
<li>one subnet in the worker VPC defined in  <a href="#org7263c86">Create VPCs</a>.
<ul class="org-ul">
<li><code>192.168.1.0/24</code></li>
</ul></li>
</ul>
<div class="org-src-container">
<pre class="src src-json">  #create subnet #<span style="color: #da8548; font-weight: bold;">1</span> in us-east-<span style="color: #da8548; font-weight: bold;">1</span>
  resource <span style="color: #98be65;">"aws_subnet"</span> <span style="color: #98be65;">"subnet_1"</span> {
    provider          = aws.region-master
    availability_zone = element(data.aws_availability_zones.azs.names, <span style="color: #da8548; font-weight: bold;">0</span>)
    vpc_id            = aws_vpc.vpc_master.id
    cidr_block        = "<span style="color: #da8548; font-weight: bold;">10.0</span>.<span style="color: #da8548; font-weight: bold;">1.0</span>/<span style="color: #da8548; font-weight: bold;">24</span>"
  }
  #create subnet #<span style="color: #da8548; font-weight: bold;">2</span> in us-east-<span style="color: #da8548; font-weight: bold;">1</span>
  resource <span style="color: #98be65;">"aws_subnet"</span> <span style="color: #98be65;">"subnet_2"</span> {
    provider          = aws.region-master
    availability_zone = element(data.aws_availability_zones.azs.names, <span style="color: #da8548; font-weight: bold;">1</span>)
    vpc_id            = aws_vpc.vpc_master.id
    cidr_block        = "<span style="color: #da8548; font-weight: bold;">10.0</span>.<span style="color: #da8548; font-weight: bold;">2.0</span>/<span style="color: #da8548; font-weight: bold;">24</span>"
  }
  #create subnet #<span style="color: #da8548; font-weight: bold;">1</span> in us-west-<span style="color: #da8548; font-weight: bold;">2</span>
  resource <span style="color: #98be65;">"aws_subnet"</span> <span style="color: #98be65;">"subnet_1_oregon"</span> {
    provider   = aws.region-worker
    vpc_id     = aws_vpc.vpc_master_oregon.id
    cidr_block = "<span style="color: #da8548; font-weight: bold;">192.168</span>.<span style="color: #da8548; font-weight: bold;">1.0</span>/<span style="color: #da8548; font-weight: bold;">24</span>"
  }
</pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-org3e3ef58" class="outline-4">
<h4 id="org3e3ef58"><span class="section-number-4">6.3.5</span> Create Peering between VPCs&#xa0;&#xa0;&#xa0;<span class="tag"><span class="peering">peering</span></span></h4>
<div class="outline-text-4" id="text-6-3-5">
<ul class="org-ul">
<li>A VPC peering connection is a networking connection between two VPCs that enables you to route traffic between them using private IPv4 addresses or IPv6 addresses.
<ul class="org-ul">
<li><a href="https://docs.aws.amazon.com/vpc/latest/peering/what-is-vpc-peering.html">https://docs.aws.amazon.com/vpc/latest/peering/what-is-vpc-peering.html</a></li>
</ul></li>
</ul>
</div>
<ol class="org-ol">
<li><a id="org4ede279"></a><a href="./terraform/network.tf">./terraform/network.tf</a><br />
<div class="outline-text-5" id="text-6-3-5-1">
<ul class="org-ul">
<li>Create a peering connection request from the master VPC.</li>
<li>Create a peering connection acceptor from the worker VPC.</li>
</ul>
<div class="org-src-container">
<pre class="src src-json">#Initiate Peering connection request from us-east-<span style="color: #da8548; font-weight: bold;">1</span>
resource <span style="color: #98be65;">"aws_vpc_peering_connection"</span> <span style="color: #98be65;">"useast1-uswest2"</span> {
  provider    = aws.region-master
  peer_vpc_id = aws_vpc.vpc_master_oregon.id
  vpc_id      = aws_vpc.vpc_master.id
  peer_region = var.region-worker

}
#Accept VPC peering request in us-west-<span style="color: #da8548; font-weight: bold;">2</span> from us-east-<span style="color: #da8548; font-weight: bold;">1</span>
resource <span style="color: #98be65;">"aws_vpc_peering_connection_accepter"</span> <span style="color: #98be65;">"accept_peering"</span> {
  provider                  = aws.region-worker
  vpc_peering_connection_id = aws_vpc_peering_connection.useast<span style="color: #a9a1e1;">1</span>-uswest<span style="color: #a9a1e1;">2</span>.id
  auto_accept               = <span style="color: #a9a1e1;">true</span>
}
</pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-org6c1efe2" class="outline-4">
<h4 id="org6c1efe2"><span class="section-number-4">6.3.6</span> Create Routing in and between VPCs&#xa0;&#xa0;&#xa0;<span class="tag"><span class="route">route</span>&#xa0;<span class="vpc">vpc</span></span></h4>
<div class="outline-text-4" id="text-6-3-6">
<ul class="org-ul">
<li>A route table contains a set of rules, called routes, that are used to determine where network traffic from your subnet or gateway is directed.
<ul class="org-ul">
<li><a href="https://docs.aws.amazon.com/vpc/latest/userguide/VPC_Route_Tables.html">https://docs.aws.amazon.com/vpc/latest/userguide/VPC_Route_Tables.html</a></li>
</ul></li>
</ul>
</div>
<ol class="org-ol">
<li><a id="org837e9c3"></a><a href="./terraform/network.tf">./terraform/network.tf</a><br />
<div class="outline-text-5" id="text-6-3-6-1">
<ul class="org-ul">
<li>create a routing table for the master VPC
<ul class="org-ul">
<li>to internet via <code>aws_internet_gateway.igw.id</code></li>
<li>to the worker VPC Peering Connection created in:  <a href="#org3e3ef58">Create Peering between VPCs</a></li>
</ul></li>
<li>replace default route of the master VPC with the routing table created above</li>
<li>create routing table for worker VPC
<ul class="org-ul">
<li>to internet via <code>aws_internet_gateway.igw.id</code></li>
<li>to the master VPC Peering Connection created in:  <a href="#org3e3ef58">Create Peering between VPCs</a></li>
</ul></li>
<li>replace default route of the worker VPC with the routing table created above</li>
</ul>
<div class="org-src-container">
<pre class="src src-json">#Create route table in us-east-<span style="color: #da8548; font-weight: bold;">1</span>
resource <span style="color: #98be65;">"aws_route_table"</span> <span style="color: #98be65;">"internet_route"</span> {
  provider = aws.region-master
  vpc_id   = aws_vpc.vpc_master.id
  route {
    cidr_block = "<span style="color: #da8548; font-weight: bold;">0.0</span>.<span style="color: #da8548; font-weight: bold;">0.0</span>/<span style="color: #da8548; font-weight: bold;">0</span>"
    gateway_id = aws_internet_gateway.igw.id
  }
  route {
    cidr_block                = "<span style="color: #da8548; font-weight: bold;">192.168</span>.<span style="color: #da8548; font-weight: bold;">1.0</span>/<span style="color: #da8548; font-weight: bold;">24</span>"
    vpc_peering_connection_id = aws_vpc_peering_connection.useast<span style="color: #a9a1e1;">1</span>-uswest<span style="color: #a9a1e1;">2</span>.id
  }
  lifecycle {
    ignore_changes = all
  }
  tags = {
    Name = <span style="color: #98be65;">"Master-Region-RT"</span>
  }
}
#Overwrite default route table of VPC(Master) with our route table entries
resource <span style="color: #98be65;">"aws_main_route_table_association"</span> <span style="color: #98be65;">"set-master-default-rt-assoc"</span> {
  provider       = aws.region-master
  vpc_id         = aws_vpc.vpc_master.id
  route_table_id = aws_route_table.internet_route.id
}
#Create route table in us-west-<span style="color: #da8548; font-weight: bold;">2</span>
resource <span style="color: #98be65;">"aws_route_table"</span> <span style="color: #98be65;">"internet_route_oregon"</span> {
  provider = aws.region-worker
  vpc_id   = aws_vpc.vpc_master_oregon.id
  route {
    cidr_block = "<span style="color: #da8548; font-weight: bold;">0.0</span>.<span style="color: #da8548; font-weight: bold;">0.0</span>/<span style="color: #da8548; font-weight: bold;">0</span>"
    gateway_id = aws_internet_gateway.igw-oregon.id
  }
  route {
    cidr_block                = "<span style="color: #da8548; font-weight: bold;">10.0</span>.<span style="color: #da8548; font-weight: bold;">1.0</span>/<span style="color: #da8548; font-weight: bold;">24</span>"
    vpc_peering_connection_id = aws_vpc_peering_connection.useast<span style="color: #a9a1e1;">1</span>-uswest<span style="color: #a9a1e1;">2</span>.id
  }
  lifecycle {
    ignore_changes = all
  }
  tags = {
    Name = <span style="color: #98be65;">"Worker-Region-RT"</span>
  }
}
#Overwrite default route table of VPC(Worker) with our route table entries
resource <span style="color: #98be65;">"aws_main_route_table_association"</span> <span style="color: #98be65;">"set-worker-default-rt-assoc"</span> {
  provider       = aws.region-worker
  vpc_id         = aws_vpc.vpc_master_oregon.id
  route_table_id = aws_route_table.internet_route_oregon.id
}
</pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-org02f0909" class="outline-4">
<h4 id="org02f0909"><span class="section-number-4">6.3.7</span> Create Security Groups&#xa0;&#xa0;&#xa0;<span class="tag"><span class="security_groups">security_groups</span></span></h4>
<div class="outline-text-4" id="text-6-3-7">
<ul class="org-ul">
<li>A security group acts as a virtual firewall for your instance to control inbound and outbound traffic.
<ul class="org-ul">
<li><a href="https://docs.aws.amazon.com/vpc/latest/userguide/VPC_SecurityGroups.html">https://docs.aws.amazon.com/vpc/latest/userguide/VPC_SecurityGroups.html</a></li>
</ul></li>
</ul>
</div>
<ol class="org-ol">
