readme.org
**** [[./terraform/security_groups.tf]]
:PROPERTIES:
:header-args: :tangle terraform/security_groups.tf
:END:
+ create a SG for the: TODO Application Load Balancer TODO
  - allow in from 80/443 web ports.
  - allow out anywhere for ephemeral ports.
+ create a security group for devops in VPC Master
  - allow in from 80/443 web ports.
  - allow out anywhere for ephemeral ports.
  - allow ssh from port 22 from our home IP
  - allow in from us-west-2 (worker) subnet created in  [[*Create Subnets in our VPCs][Create Subnets in our VPCs]]
+ create a security group for devops in VPC worker
  - allow in from 80/443 web ports.
  - allow out anywhere for ephemeral ports.
  - allow ssh from port 22 from our home IP
  - allow in from us-east-1 (master) subnet created in  [[*Create Subnets in our VPCs][Create Subnets in our VPCs]]
#+begin_src json
#Create SG for LB, only TCP/80,TCP/443 and outbound access
resource "aws_security_group" "lb-sg" {
  provider    = aws.region-master
  name        = "lb-sg"
  description = "Allow 443 and traffic to devops SG"
  vpc_id      = aws_vpc.vpc_master.id
  ingress {
    description = "Allow 443 from anywhere"
    from_port   = 443
    to_port     = 443
    protocol    = "tcp"
    cidr_blocks = ["0.0.0.0/0"]
  }
  ingress {
    description = "Allow 80 from anywhere for redirection"
    from_port   = 80
    to_port     = 80
    protocol    = "tcp"
    cidr_blocks = ["0.0.0.0/0"]
  }
  egress {
    from_port   = 0
    to_port     = 0
    protocol    = "-1"
    cidr_blocks = ["0.0.0.0/0"]
  }
}
#Create SG for allowing TCP/8080 from * and TCP/22 from your IP in us-east-1
resource "aws_security_group" "devops-sg" {
  provider    = aws.region-master
  name        = "devops-sg"
  description = "Allow TCP/8080 & TCP/22"
  vpc_id      = aws_vpc.vpc_master.id
  ingress {
    description = "Allow 22 from our public IP"
    from_port   = 22
    to_port     = 22
    protocol    = "tcp"
    cidr_blocks = [var.external_ip]
  }
  ingress {
    description     = "allow anyone on port 8080"
    from_port       = 8080
    to_port         = 8080
    protocol        = "tcp"
    security_groups = [aws_security_group.lb-sg.id]
  }
  ingress {
    description = "allow traffic from us-west-2"
    from_port   = 0
    to_port     = 0
    protocol    = "-1"
    cidr_blocks = ["192.168.1.0/24"]
  }
  egress {
    from_port   = 0
    to_port     = 0
    protocol    = "-1"
    cidr_blocks = ["0.0.0.0/0"]
  }
}
#Create SG for allowing TCP/22 from your IP in us-west-2
resource "aws_security_group" "devops-sg-oregon" {
  provider = aws.region-worker

  name        = "devops-sg-oregon"
  description = "Allow TCP/8080 & TCP/22"
  vpc_id      = aws_vpc.vpc_master_oregon.id
  ingress {
    description = "Allow 22 from our public IP"
    from_port   = 22
    to_port     = 22
    protocol    = "tcp"
    cidr_blocks = [var.external_ip]
  }
  ingress {
    description = "Allow traffic from us-east-1"
    from_port   = 0
    to_port     = 0
    protocol    = "-1"
    cidr_blocks = ["10.0.1.0/24"]
  }
  egress {
    from_port   = 0
    to_port     = 0
    protocol    = "-1"
    cidr_blocks = ["0.0.0.0/0"]
  }
}
#+end_src
** Create IAM Role for EC2 Access :ec2:iam:
*** [[./terraform/iam.tf]] :aws_iam_role:
:PROPERTIES:
:header-args: :tangle terraform/iam.tf
:END:
#+begin_src json
resource "aws_iam_role" "test_role" {
  name = "test_role"
  provider                    = aws.region-master
  assume_role_policy = <<EOF
{
  "Version": "2012-10-17",
  "Statement": [
    {
      "Action": "sts:AssumeRole",
      "Principal": {
        "Service": "ec2.amazonaws.com"
      },
      "Effect": "Allow",
      "Sid": ""
    }
  ]
}
EOF
  tags = {
      tag-key = "tag-value"
  }
}
#+end_src
*** [[./terraform/iam.tf]] :aws_iam_instance_profile:
:PROPERTIES:
:header-args: :tangle terraform/iam.tf
:END:
#+begin_src json
resource "aws_iam_instance_profile" "test_profile" {
  name = "test_profile"
 provider                    = aws.region-master
  role = "${aws_iam_role.test_role.name}"
}
#+end_src
