index.html
<li><a id="orgbefcc85"></a><a href="./terraform/security_groups.tf">./terraform/security_groups.tf</a><br />
<div class="outline-text-5" id="text-6-3-7-1">
<ul class="org-ul">
<li>create a SG for the: TODO Application Load Balancer TODO
<ul class="org-ul">
<li>allow in from 80/443 web ports.</li>
<li>allow out anywhere for ephemeral ports.</li>
</ul></li>
<li>create a security group for devops in VPC Master
<ul class="org-ul">
<li>allow in from 80/443 web ports.</li>
<li>allow out anywhere for ephemeral ports.</li>
<li>allow ssh from port 22 from our home IP</li>
<li>allow in from us-west-2 (worker) subnet created in  <a href="#org5c46a18">Create Subnets in our VPCs</a></li>
</ul></li>
<li>create a security group for devops in VPC worker
<ul class="org-ul">
<li>allow in from 80/443 web ports.</li>
<li>allow out anywhere for ephemeral ports.</li>
<li>allow ssh from port 22 from our home IP</li>
<li>allow in from us-east-1 (master) subnet created in  <a href="#org5c46a18">Create Subnets in our VPCs</a></li>
</ul></li>
</ul>
<div class="org-src-container">
<pre class="src src-json">#Create SG for LB, only TCP/<span style="color: #da8548; font-weight: bold;">80</span>,TCP/<span style="color: #da8548; font-weight: bold;">443</span> and outbound access
resource <span style="color: #98be65;">"aws_security_group"</span> <span style="color: #98be65;">"lb-sg"</span> {
  provider    = aws.region-master
  name        = <span style="color: #98be65;">"lb-sg"</span>
  description = "Allow <span style="color: #da8548; font-weight: bold;">443</span> and traffic to devops SG"
  vpc_id      = aws_vpc.vpc_master.id
  ingress {
    description = "Allow <span style="color: #da8548; font-weight: bold;">443</span> from anywhere"
    from_port   = <span style="color: #da8548; font-weight: bold;">443</span>
    to_port     = <span style="color: #da8548; font-weight: bold;">443</span>
    protocol    = <span style="color: #98be65;">"tcp"</span>
    cidr_blocks = ["<span style="color: #da8548; font-weight: bold;">0.0</span>.<span style="color: #da8548; font-weight: bold;">0.0</span>/<span style="color: #da8548; font-weight: bold;">0</span>"]
  }
  ingress {
    description = "Allow <span style="color: #da8548; font-weight: bold;">80</span> from anywhere for redirection"
    from_port   = <span style="color: #da8548; font-weight: bold;">80</span>
    to_port     = <span style="color: #da8548; font-weight: bold;">80</span>
    protocol    = <span style="color: #98be65;">"tcp"</span>
    cidr_blocks = ["<span style="color: #da8548; font-weight: bold;">0.0</span>.<span style="color: #da8548; font-weight: bold;">0.0</span>/<span style="color: #da8548; font-weight: bold;">0</span>"]
  }
  egress {
    from_port   = <span style="color: #da8548; font-weight: bold;">0</span>
    to_port     = <span style="color: #da8548; font-weight: bold;">0</span>
    protocol    = "-<span style="color: #da8548; font-weight: bold;">1</span>"
    cidr_blocks = ["<span style="color: #da8548; font-weight: bold;">0.0</span>.<span style="color: #da8548; font-weight: bold;">0.0</span>/<span style="color: #da8548; font-weight: bold;">0</span>"]
  }
}
#Create SG for allowing TCP/<span style="color: #da8548; font-weight: bold;">8080</span> from * and TCP/<span style="color: #da8548; font-weight: bold;">22</span> from your IP in us-east-<span style="color: #da8548; font-weight: bold;">1</span>
resource <span style="color: #98be65;">"aws_security_group"</span> <span style="color: #98be65;">"devops-sg"</span> {
  provider    = aws.region-master
  name        = <span style="color: #98be65;">"devops-sg"</span>
  description = "Allow TCP/<span style="color: #da8548; font-weight: bold;">8080</span> &amp; TCP/<span style="color: #da8548; font-weight: bold;">22</span>"
  vpc_id      = aws_vpc.vpc_master.id
  ingress {
    description = "Allow <span style="color: #da8548; font-weight: bold;">22</span> from our public IP"
    from_port   = <span style="color: #da8548; font-weight: bold;">22</span>
    to_port     = <span style="color: #da8548; font-weight: bold;">22</span>
    protocol    = <span style="color: #98be65;">"tcp"</span>
    cidr_blocks = [var.external_ip]
  }
  ingress {
    description     = "allow anyone on port <span style="color: #da8548; font-weight: bold;">8080</span>"
    from_port       = <span style="color: #da8548; font-weight: bold;">8080</span>
    to_port         = <span style="color: #da8548; font-weight: bold;">8080</span>
    protocol        = <span style="color: #98be65;">"tcp"</span>
    security_groups = [aws_security_group.lb-sg.id]
  }
  ingress {
    description = "allow traffic from us-west-<span style="color: #da8548; font-weight: bold;">2</span>"
    from_port   = <span style="color: #da8548; font-weight: bold;">0</span>
    to_port     = <span style="color: #da8548; font-weight: bold;">0</span>
    protocol    = "-<span style="color: #da8548; font-weight: bold;">1</span>"
    cidr_blocks = ["<span style="color: #da8548; font-weight: bold;">192.168</span>.<span style="color: #da8548; font-weight: bold;">1.0</span>/<span style="color: #da8548; font-weight: bold;">24</span>"]
  }
  egress {
    from_port   = <span style="color: #da8548; font-weight: bold;">0</span>
    to_port     = <span style="color: #da8548; font-weight: bold;">0</span>
    protocol    = "-<span style="color: #da8548; font-weight: bold;">1</span>"
    cidr_blocks = ["<span style="color: #da8548; font-weight: bold;">0.0</span>.<span style="color: #da8548; font-weight: bold;">0.0</span>/<span style="color: #da8548; font-weight: bold;">0</span>"]
  }
}
#Create SG for allowing TCP/<span style="color: #da8548; font-weight: bold;">22</span> from your IP in us-west-<span style="color: #da8548; font-weight: bold;">2</span>
resource <span style="color: #98be65;">"aws_security_group"</span> <span style="color: #98be65;">"devops-sg-oregon"</span> {
  provider = aws.region-worker

  name        = <span style="color: #98be65;">"devops-sg-oregon"</span>
  description = "Allow TCP/<span style="color: #da8548; font-weight: bold;">8080</span> &amp; TCP/<span style="color: #da8548; font-weight: bold;">22</span>"
  vpc_id      = aws_vpc.vpc_master_oregon.id
  ingress {
    description = "Allow <span style="color: #da8548; font-weight: bold;">22</span> from our public IP"
    from_port   = <span style="color: #da8548; font-weight: bold;">22</span>
    to_port     = <span style="color: #da8548; font-weight: bold;">22</span>
    protocol    = <span style="color: #98be65;">"tcp"</span>
    cidr_blocks = [var.external_ip]
  }
  ingress {
    description = "Allow traffic from us-east-<span style="color: #da8548; font-weight: bold;">1</span>"
    from_port   = <span style="color: #da8548; font-weight: bold;">0</span>
    to_port     = <span style="color: #da8548; font-weight: bold;">0</span>
    protocol    = "-<span style="color: #da8548; font-weight: bold;">1</span>"
    cidr_blocks = ["<span style="color: #da8548; font-weight: bold;">10.0</span>.<span style="color: #da8548; font-weight: bold;">1.0</span>/<span style="color: #da8548; font-weight: bold;">24</span>"]
  }
  egress {
    from_port   = <span style="color: #da8548; font-weight: bold;">0</span>
    to_port     = <span style="color: #da8548; font-weight: bold;">0</span>
    protocol    = "-<span style="color: #da8548; font-weight: bold;">1</span>"
    cidr_blocks = ["<span style="color: #da8548; font-weight: bold;">0.0</span>.<span style="color: #da8548; font-weight: bold;">0.0</span>/<span style="color: #da8548; font-weight: bold;">0</span>"]
  }
}
</pre>
</div>
</div>
</li>
</ol>
</div>
</div>
<div id="outline-container-orge72d2a5" class="outline-3">
<h3 id="orge72d2a5"><span class="section-number-3">6.4</span> Create IAM Role for EC2 Access&#xa0;&#xa0;&#xa0;<span class="tag"><span class="ec2">ec2</span>&#xa0;<span class="iam">iam</span></span></h3>
<div class="outline-text-3" id="text-6-4">
</div>
<div id="outline-container-org9d855b8" class="outline-4">
<h4 id="org9d855b8"><span class="section-number-4">6.4.1</span> <a href="./terraform/iam.tf">./terraform/iam.tf</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="aws_iam_role">aws_iam_role</span></span></h4>
<div class="outline-text-4" id="text-6-4-1">
<div class="org-src-container">
<pre class="src src-json">resource <span style="color: #98be65;">"aws_iam_role"</span> <span style="color: #98be65;">"test_role"</span> {
  name = <span style="color: #98be65;">"test_role"</span>
  provider                    = aws.region-master
  assume_role_policy = &lt;&lt;EOF
{
  <span style="color: #51afef;">"Version"</span>: "<span style="color: #da8548; font-weight: bold;">2012</span>-<span style="color: #da8548; font-weight: bold;">10</span>-<span style="color: #da8548; font-weight: bold;">17</span>",
  <span style="color: #51afef;">"Statement"</span>: [
    {
      <span style="color: #51afef;">"Action"</span>: <span style="color: #98be65;">"sts:AssumeRole"</span>,
      <span style="color: #51afef;">"Principal"</span>: {
        <span style="color: #51afef;">"Service"</span>: <span style="color: #98be65;">"ec2.amazonaws.com"</span>
      },
      <span style="color: #51afef;">"Effect"</span>: <span style="color: #98be65;">"Allow"</span>,
      <span style="color: #51afef;">"Sid"</span>: <span style="color: #98be65;">""</span>
    }
  ]
}
EOF
  tags = {
      tag-key = <span style="color: #98be65;">"tag-value"</span>
  }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb73ba76" class="outline-4">
<h4 id="orgb73ba76"><span class="section-number-4">6.4.2</span> <a href="./terraform/iam.tf">./terraform/iam.tf</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="aws_iam_instance_profile">aws_iam_instance_profile</span></span></h4>
<div class="outline-text-4" id="text-6-4-2">
<div class="org-src-container">
<pre class="src src-json">resource <span style="color: #98be65;">"aws_iam_instance_profile"</span> <span style="color: #98be65;">"test_profile"</span> {
  name = <span style="color: #98be65;">"test_profile"</span>
 provider                    = aws.region-master
  role = <span style="color: #98be65;">"${aws_iam_role.test_role.name}"</span>
}
</pre>
</div>
</div>
</div>
