readme.org
*** [[./terraform/iam.tf]] :aws_iam_role_policy:
:PROPERTIES:
:header-args: :tangle terraform/iam.tf
:END:
#+begin_src json
resource "aws_iam_role_policy" "test_policy" {
  name = "test_policy"
provider                    = aws.region-master
  role = "${aws_iam_role.test_role.id}"

  policy = <<EOF
{
  "Version": "2012-10-17",
  "Statement": [
    {
      "Action": [
        "s3:*",
        "ec2:*"
      ],
      "Effect": "Allow",
      "Resource": "*"
    }
  ]
}
EOF
}
#+end_src
** Create Instances
*** Get AMIs :ami:vm:
- An Amazon Machine Image (AMI) provides the information required to launch an instance.
  + https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/AMIs.html
**** [[./terraform/instances.tf]]
:PROPERTIES:
:header-args: :tangle terraform/instances.tf
:END:
+ data
  - get the AMI names for the latest Amazon Linux AMI
  - store this as linuxAmi and linuxAmiOregon
  - can later be accessed with: ~data.aws_ssm_parameter.linuxAmi.value~
#+begin_src json
#Get Linux AMI ID using SSM Parameter endpoint in us-east-1
data "aws_ssm_parameter" "linuxAmi" {
  provider = aws.region-master
  name     = "/aws/service/ami-amazon-linux-latest/amzn2-ami-hvm-x86_64-gp2"
}
#Get Linux AMI ID using SSM Parameter endpoint in us-west-2
data "aws_ssm_parameter" "linuxAmiOregon" {
  provider = aws.region-worker
  name     = "/aws/service/ami-amazon-linux-latest/amzn2-ami-hvm-x86_64-gp2"
}
#+end_src
*** Set cloud-init Scripts
**** [[./terraform/instances.tf]]
:PROPERTIES:
:header-args: :tangle terraform/instances.tf
:END:
+ data
  - store cloud-init as data to pass to EC2 for boostrapping
#+begin_src json
data "template_file" "user_data" {
  template = file("./scripts/cloud-init.yaml")
}
#+end_src
*** Configure SSH keypairs for AMI VMs :keypair:
- A key pair, consisting of a public key and a private key, is a set of security credentials that you use to prove your identity when connecting to an Amazon EC2 instance. Amazon EC2 stores the public key on your instance, and you store the private key. For Linux instances, the private key allows you to securely SSH into your instance. Anyone who possesses your private key can connect to your instances, so it's important that you store your private key in a secure place.
  + [[https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/ec2-key-pairs.html][EC2 Keypairs]]
**** [[./terraform/instances.tf]]
:PROPERTIES:
:header-args: :tangle terraform/instances.tf
:END:
+ assign keypairs for each region from [[./terraform/ssh/id_rsa.pub]]
#+begin_src json
#Create key-pair for logging into EC2 in us-east-1
resource "aws_key_pair" "master-key" {
  provider = aws.region-master
  key_name = "devops"
  public_key = file("ssh/id_rsa.pub")
}
#Create key-pair for logging into EC2 in us-west-2
resource "aws_key_pair" "worker-key" {
  provider = aws.region-worker
  key_name = "devops"
  public_key = file("ssh/id_rsa.pub")
}
#+end_src
*** Create EC2 Instances :ec2:
- Amazon Elastic Compute Cloud (Amazon EC2) is a web service that provides secure, resizable compute capacity in the cloud. It is designed to make web-scale cloud computing easier for developers.
  + [[https://aws.amazon.com/ec2/?ec2-whats-new.sort-by=item.additionalFields.postDateTime&ec2-whats-new.sort-order=desc][AWS EC2]]
**** [[./terraform/instances.tf]]
:PROPERTIES:
:header-args: :tangle terraform/instances.tf
:END:
#+begin_src json
#Create and bootstrap EC2 in us-east-1
resource "aws_instance" "devops-master" {
  provider                    = aws.region-master
  ami                         = data.aws_ssm_parameter.linuxAmi.value
  instance_type               = var.instance-type
  key_name                    = aws_key_pair.master-key.key_name
  associate_public_ip_address = true
  vpc_security_group_ids      = [aws_security_group.devops-sg.id]
  subnet_id                   = aws_subnet.subnet_1.id
  user_data                   = data.template_file.user_data.rendered
  iam_instance_profile = "${aws_iam_instance_profile.test_profile.name}"
  tags = {
    Name = "devops_master_tf"
  }
  depends_on = [aws_main_route_table_association.set-master-default-rt-assoc]
}
#Create EC2 in us-west-2
resource "aws_instance" "devops-worker-oregon" {
  provider                    = aws.region-worker
  count                       = var.workers-count
  ami                         = data.aws_ssm_parameter.linuxAmiOregon.value
  instance_type               = var.instance-type
  key_name                    = aws_key_pair.worker-key.key_name
  associate_public_ip_address = true
  vpc_security_group_ids      = [aws_security_group.devops-sg-oregon.id]
  subnet_id                   = aws_subnet.subnet_1_oregon.id
  tags = {
    Name = join("_", ["devops_worker_tf", count.index + 1])
  }
  depends_on = [aws_main_route_table_association.set-worker-default-rt-assoc, aws_instance.devops-master]
}
#+end_src
** S3 :s3:
:PROPERTIES:
:CUSTOM_ID: -create-infrastructure-with-terraform-s3-
:END:
- Attaching an S3 bucket to hold  miscellaneous data that may be needed during/post provisioning.
