index.html
<div id="outline-container-org0a4a01f" class="outline-4">
<h4 id="org0a4a01f"><span class="section-number-4">6.4.3</span> <a href="./terraform/iam.tf">./terraform/iam.tf</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="aws_iam_role_policy">aws_iam_role_policy</span></span></h4>
<div class="outline-text-4" id="text-6-4-3">
<div class="org-src-container">
<pre class="src src-json">resource <span style="color: #98be65;">"aws_iam_role_policy"</span> <span style="color: #98be65;">"test_policy"</span> {
  name = <span style="color: #98be65;">"test_policy"</span>
provider                    = aws.region-master
  role = <span style="color: #98be65;">"${aws_iam_role.test_role.id}"</span>

  policy = &lt;&lt;EOF
{
  <span style="color: #51afef;">"Version"</span>: "<span style="color: #da8548; font-weight: bold;">2012</span>-<span style="color: #da8548; font-weight: bold;">10</span>-<span style="color: #da8548; font-weight: bold;">17</span>",
  <span style="color: #51afef;">"Statement"</span>: [
    {
      <span style="color: #51afef;">"Action"</span>: [
        <span style="color: #98be65;">"s3:*"</span>,
        <span style="color: #98be65;">"ec2:*"</span>
      ],
      <span style="color: #51afef;">"Effect"</span>: <span style="color: #98be65;">"Allow"</span>,
      <span style="color: #51afef;">"Resource"</span>: <span style="color: #98be65;">"*"</span>
    }
  ]
}
EOF
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orge00f99d" class="outline-3">
<h3 id="orge00f99d"><span class="section-number-3">6.5</span> Create Instances</h3>
<div class="outline-text-3" id="text-6-5">
</div>
<div id="outline-container-org58d0f3b" class="outline-4">
<h4 id="org58d0f3b"><span class="section-number-4">6.5.1</span> Get AMIs&#xa0;&#xa0;&#xa0;<span class="tag"><span class="ami">ami</span>&#xa0;<span class="vm">vm</span></span></h4>
<div class="outline-text-4" id="text-6-5-1">
<ul class="org-ul">
<li>An Amazon Machine Image (AMI) provides the information required to launch an instance.
<ul class="org-ul">
<li><a href="https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/AMIs.html">https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/AMIs.html</a></li>
</ul></li>
</ul>
</div>
<ol class="org-ol">
<li><a id="org0c9d2a9"></a><a href="./terraform/instances.tf">./terraform/instances.tf</a><br />
<div class="outline-text-5" id="text-6-5-1-1">
<ul class="org-ul">
<li>data
<ul class="org-ul">
<li>get the AMI names for the latest Amazon Linux AMI</li>
<li>store this as linuxAmi and linuxAmiOregon</li>
<li>can later be accessed with: <code>data.aws_ssm_parameter.linuxAmi.value</code></li>
</ul></li>
</ul>
<div class="org-src-container">
<pre class="src src-json">#Get Linux AMI ID using SSM Parameter endpoint in us-east-<span style="color: #da8548; font-weight: bold;">1</span>
data <span style="color: #98be65;">"aws_ssm_parameter"</span> <span style="color: #98be65;">"linuxAmi"</span> {
  provider = aws.region-master
  name     = <span style="color: #98be65;">"/aws/service/ami-amazon-linux-latest/amzn2-ami-hvm-x86_64-gp2"</span>
}
#Get Linux AMI ID using SSM Parameter endpoint in us-west-<span style="color: #da8548; font-weight: bold;">2</span>
data <span style="color: #98be65;">"aws_ssm_parameter"</span> <span style="color: #98be65;">"linuxAmiOregon"</span> {
  provider = aws.region-worker
  name     = <span style="color: #98be65;">"/aws/service/ami-amazon-linux-latest/amzn2-ami-hvm-x86_64-gp2"</span>
}
</pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-orgfc3d56d" class="outline-4">
<h4 id="orgfc3d56d"><span class="section-number-4">6.5.2</span> Set cloud-init Scripts</h4>
<div class="outline-text-4" id="text-6-5-2">
</div>
<ol class="org-ol">
<li><a id="org36d5dae"></a><a href="./terraform/instances.tf">./terraform/instances.tf</a><br />
<div class="outline-text-5" id="text-6-5-2-1">
<ul class="org-ul">
<li>data
<ul class="org-ul">
<li>store cloud-init as data to pass to EC2 for boostrapping</li>
</ul></li>
</ul>
<div class="org-src-container">
<pre class="src src-json">data <span style="color: #98be65;">"template_file"</span> <span style="color: #98be65;">"user_data"</span> {
  template = file(<span style="color: #98be65;">"./scripts/cloud-init.yaml"</span>)
}
</pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-org72efbb0" class="outline-4">
<h4 id="org72efbb0"><span class="section-number-4">6.5.3</span> Configure SSH keypairs for AMI VMs&#xa0;&#xa0;&#xa0;<span class="tag"><span class="keypair">keypair</span></span></h4>
<div class="outline-text-4" id="text-6-5-3">
<ul class="org-ul">
<li>A key pair, consisting of a public key and a private key, is a set of security credentials that you use to prove your identity when connecting to an Amazon EC2 instance. Amazon EC2 stores the public key on your instance, and you store the private key. For Linux instances, the private key allows you to securely SSH into your instance. Anyone who possesses your private key can connect to your instances, so it&rsquo;s important that you store your private key in a secure place.
<ul class="org-ul">
<li><a href="https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/ec2-key-pairs.html">EC2 Keypairs</a></li>
</ul></li>
</ul>
</div>
<ol class="org-ol">
<li><a id="org90dae70"></a><a href="./terraform/instances.tf">./terraform/instances.tf</a><br />
<div class="outline-text-5" id="text-6-5-3-1">
<ul class="org-ul">
<li>assign keypairs for each region from <a href="./terraform/ssh/id_rsa.pub">./terraform/ssh/id_rsa.pub</a></li>
</ul>
<div class="org-src-container">
<pre class="src src-json">#Create key-pair for logging into EC<span style="color: #a9a1e1;">2</span> in us-east-<span style="color: #da8548; font-weight: bold;">1</span>
resource <span style="color: #98be65;">"aws_key_pair"</span> <span style="color: #98be65;">"master-key"</span> {
  provider = aws.region-master
  key_name = <span style="color: #98be65;">"devops"</span>
  public_key = file(<span style="color: #98be65;">"ssh/id_rsa.pub"</span>)
}
#Create key-pair for logging into EC<span style="color: #a9a1e1;">2</span> in us-west-<span style="color: #da8548; font-weight: bold;">2</span>
resource <span style="color: #98be65;">"aws_key_pair"</span> <span style="color: #98be65;">"worker-key"</span> {
  provider = aws.region-worker
  key_name = <span style="color: #98be65;">"devops"</span>
  public_key = file(<span style="color: #98be65;">"ssh/id_rsa.pub"</span>)
}
</pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-org0947e7f" class="outline-4">
<h4 id="org0947e7f"><span class="section-number-4">6.5.4</span> Create EC2 Instances&#xa0;&#xa0;&#xa0;<span class="tag"><span class="ec2">ec2</span></span></h4>
<div class="outline-text-4" id="text-6-5-4">
<ul class="org-ul">
<li>Amazon Elastic Compute Cloud (Amazon EC2) is a web service that provides secure, resizable compute capacity in the cloud. It is designed to make web-scale cloud computing easier for developers.
<ul class="org-ul">
<li><a href="https://aws.amazon.com/ec2/?ec2-whats-new.sort-by=item.additionalFields.postDateTime&amp;ec2-whats-new.sort-order=desc">AWS EC2</a></li>
</ul></li>
</ul>
</div>
<ol class="org-ol">
<li><a id="orgb9b78b9"></a><a href="./terraform/instances.tf">./terraform/instances.tf</a><br />
<div class="outline-text-5" id="text-6-5-4-1">
<div class="org-src-container">
<pre class="src src-json">#Create and bootstrap EC<span style="color: #a9a1e1;">2</span> in us-east-<span style="color: #da8548; font-weight: bold;">1</span>
resource <span style="color: #98be65;">"aws_instance"</span> <span style="color: #98be65;">"devops-master"</span> {
  provider                    = aws.region-master
  ami                         = data.aws_ssm_parameter.linuxAmi.value
  instance_type               = var.instance-type
  key_name                    = aws_key_pair.master-key.key_name
  associate_public_ip_address = <span style="color: #a9a1e1;">true</span>
  vpc_security_group_ids      = [aws_security_group.devops-sg.id]
  subnet_id                   = aws_subnet.subnet_<span style="color: #a9a1e1;">1</span>.id
  user_data                   = data.template_file.user_data.rendered
  iam_instance_profile = <span style="color: #98be65;">"${aws_iam_instance_profile.test_profile.name}"</span>
  tags = {
    Name = <span style="color: #98be65;">"devops_master_tf"</span>
  }
  depends_on = [aws_main_route_table_association.set-master-default-rt-assoc]
}
#Create EC<span style="color: #a9a1e1;">2</span> in us-west-<span style="color: #da8548; font-weight: bold;">2</span>
resource <span style="color: #98be65;">"aws_instance"</span> <span style="color: #98be65;">"devops-worker-oregon"</span> {
  provider                    = aws.region-worker
  count                       = var.workers-count
  ami                         = data.aws_ssm_parameter.linuxAmiOregon.value
  instance_type               = var.instance-type
  key_name                    = aws_key_pair.worker-key.key_name
  associate_public_ip_address = <span style="color: #a9a1e1;">true</span>
  vpc_security_group_ids      = [aws_security_group.devops-sg-oregon.id]
  subnet_id                   = aws_subnet.subnet_<span style="color: #a9a1e1;">1</span>_oregon.id
  tags = {
    Name = join(<span style="color: #98be65;">"_"</span>, [<span style="color: #98be65;">"devops_worker_tf"</span>, count.index + <span style="color: #da8548; font-weight: bold;">1</span>])
  }
  depends_on = [aws_main_route_table_association.set-worker-default-rt-assoc, aws_instance.devops-master]
}
</pre>
</div>
</div>
</li>
</ol>
</div>
</div>
<div id="outline-container--create-infrastructure-with-terraform-s3-" class="outline-3">
<h3 id="-create-infrastructure-with-terraform-s3-"><span class="section-number-3">6.6</span> S3&#xa0;&#xa0;&#xa0;<span class="tag"><span class="s3">s3</span></span></h3>
<div class="outline-text-3" id="text--create-infrastructure-with-terraform-s3-">
<ul class="org-ul">
<li>Attaching an S3 bucket to hold  miscellaneous data that may be needed during/post provisioning.</li>
</ul>
</div>
