readme.org
*** [[./terraform/s3.tf]] :aws_s3:
:PROPERTIES:
:header-args: :tangle terraform/s3.tf
:END:
#+begin_src json
resource "aws_s3_bucket" "misc-data" {
  provider  = aws.region-master
  bucket    = "hilgendorf-misc-data"
  acl       = "private"

  tags = {
    Name        = "misc data"
  }
}
#+end_src
- Currently getting error when creating, seemingly unable to add/list tags, commenting out until further investigation.
  + error:
    Error: error updating S3 Bucket (hilgendorf-misc-data) tags: error listing resource tags (hilgendorf-misc-data): AccessDenied: Access Denied status code: 403, request id: TR6J0XR2TT65SF3N, host id: 53e1UhXXF/V7BXwyudSim+1LG895eIc0dL2+5RDVA7lRdjmxzuzyKDb7eCGCgFlGGEMNHGOBwsM=
    with aws_s3_bucket.misc-data
    on s3.tf line 1, in resource "aws_s3_bucket" "misc-data":

    resource "aws_s3_bucket" "misc-data" {
  + Issue was due to *IAM*, policy updated [[*Create IAM User and Policies][Create IAM User and Policies]] but need to further refine. This worked after giving ~"s3:*"~ to ~terraform-user~
** Create EFS :efs:
*** [[./terraform/efs.tf]]
:PROPERTIES:
:header-args: :tangle terraform/efs.tf
:END:
#+begin_src json
resource "aws_efs_file_system" "dev" {
  creation_token = "dev-volume"
  provider  = aws.region-master
  tags = {
    Name = "keys"
  }
}
#+end_src
** ECS for AWX :awx:ecs:
:PROPERTIES:
:CUSTOM_ID: -create-infrastructure-with-terraform-ecs-for-awx-
:END:
- An Amazon ECS service allows you to run and maintain a specified number of instances of a task definition simultaneously in an Amazon ECS cluster. If any of your tasks should fail or stop for any reason, the Amazon ECS service scheduler launches another instance of your task definition to replace it in order to maintain the desired number of tasks in the service.
*** ECR :ecr:
- Need to create an ECR to store our [[#-configuration-management-with-ansible-awx-][AWX]] image.
**** [[./terraform/policies/terraform_user.json]]
:PROPERTIES:
:header-args: :tangle terraform/policies/terraform_user.json
:END:
- Need ECR access to create the repository.
#+begin_src json
        "ecr:*",
#+end_src
**** [[./terraform/ecr.tf]]
:PROPERTIES:
:header-args: :tangle terraform/ecr.tf
:END:
#+begin_src json
resource "aws_ecr_repository" "images" {
  name                 = "docker_images"
  image_tag_mutability = "MUTABLE"
  region = var.region-master

  image_scanning_configuration {
    scan_on_push = true
  }
}
#+end_src
*** ECS _untangled_ :ecs:
**** [[./terraform/policies/terraform_user.json]]
:PROPERTIES:
:header-args: :tangle terraform/policies/terraform_user.json
:END:
#+begin_src json
        "elasticfilesystem:*",
#+end_src
**** [[./terraform/ecs.tf]]
:PROPERTIES:
:header-args: :tangle no
:END:
#+begin_src json
resource "aws_ecs_service" "mongo" {
  name            = "mongodb"
  cluster         = aws_ecs_cluster.foo.id
  task_definition = aws_ecs_task_definition.mongo.arn
  desired_count   = 3
  iam_role        = aws_iam_role.foo.arn
  depends_on      = [aws_iam_role_policy.foo]

  ordered_placement_strategy {
    type  = "binpack"
    field = "cpu"
  }

  load_balancer {
    target_group_arn = aws_lb_target_group.foo.arn
    container_name   = "mongo"
    container_port   = 8080
  }

  placement_constraints {
    type       = "memberOf"
    expression = "attribute:ecs.availability-zone in [us-west-2a, us-west-2b]"
  }
}
#+end_src
** Create Outputs :output:
*** [[./terraform/outputs.tf]] :outputs:
:PROPERTIES:
:header-args: :tangle terraform/outputs.tf
:END:
#+begin_src json
output "Devops-Main-Node-Public-IP" {
  value = aws_instance.devops-master.public_ip
}

output "Devops-Worker-Public-IPs" {
  value = {
    for instance in aws_instance.devops-worker-oregon :
    instance.id => instance.public_ip
  }
}
#+end_src
* Bootstrap EC2 with cloud-init :cloud_init:
- https://cloudinit.readthedocs.io/en/latest/
- https://cloudinit.readthedocs.io/en/latest/topics/examples.html
** [[./terraform/scripts/cloud-init.yaml]] :cloudinit:script:
:PROPERTIES:
:header-args: :tangle terraform/scripts/cloud-init.yaml
:END:
+ install software
+ create users
+ jenkins-master will also be ansible master
+ create ssh key
+ copy it to ec2-user known keys
#+begin_src yaml
#cloud-config
package_update: true
package_upgrade: true
packages:
  - awscli
  - tmux
  - ansible
  - git
  - python3
  - python3-pip
  - python-boto3
runcmd:
  - aws --version
  - echo "cathead-biscuit"
  - yum update -y
  - amazon-linux-extras install ansible2
  - ansible --version
  - git clone https://github.com/edhilgendorf/ansible-cloud.git
  - pip3 install boto3
  - sudo mkdir -p /opt/ansible/inventory
#+end_src
** [[./terraform/scripts/cloud-init.yaml]] :cloudinit:script:
:PROPERTIES:
:header-args: :tangle terraform/scripts/cloud-init.yaml
:END:
- We need to get public SSH keys synced from master. Current plan is to add IAM ([[*Create IAM Role for EC2 Access][Create IAM Role for EC2 Access]]) roles to the EC2 instances so they can add and download keys via AWS CLI ([[*Use AWS CLI][Use AWS CLI]])
* Configuration Management with Ansible :ansible:
- This will be focused on a new repository: [[https://github.com/edhilgendorf/ansible-cloud.git][ansible-cloud]]
- From here we will provision all agent EC2 instances created in [[*Create Infrastructure with Terraform][Create Infrastructure with Terraform]] with Ansible, starting with Jenkins
** +Getting AWS Credentials to Ansible+ This is best configured by attaching a role to the EC2 instance, done here: [[*Create IAM Role for EC2 Access][Create IAM Role for EC2 Access]]
- Local AWS access via [[https://aws.amazon.com/cli/][AWS CLI]] must be configured prior to this point, so we are going to leverage those credentials to get them into place on the EC2 server so we are able to build and maintain our [[*Dynamic Inventory][Dynamic Inventory]].
- To do this we will need to run a local script, *after* Terraform provisioning is complete.
*** [[./terraform/sync-aws-creds.sh]]
:PROPERTIES:
:header-args: :tangle ./terraform/sync-aws-creds.sh
:END:
#+begin_src json
rsync -vaP ~/.aws/credentials ec2-user@$(terraform output -json | jq  -r '."Jenkins-Main-Node-Public-IP"."value"'):/tmp/credentials
#+end_src
