index.html
<div id="outline-container-org38c889a" class="outline-4">
<h4 id="org38c889a"><span class="section-number-4">6.6.1</span> <a href="./terraform/s3.tf">./terraform/s3.tf</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="aws_s3">aws_s3</span></span></h4>
<div class="outline-text-4" id="text-6-6-1">
<div class="org-src-container">
<pre class="src src-json">resource <span style="color: #98be65;">"aws_s3_bucket"</span> <span style="color: #98be65;">"misc-data"</span> {
  provider  = aws.region-master
  bucket    = <span style="color: #98be65;">"hilgendorf-misc-data"</span>
  acl       = <span style="color: #98be65;">"private"</span>

  tags = {
    Name        = <span style="color: #98be65;">"misc data"</span>
  }
}
</pre>
</div>
<ul class="org-ul">
<li>Currently getting error when creating, seemingly unable to add/list tags, commenting out until further investigation.
<ul class="org-ul">
<li><p>
error:
Error: error updating S3 Bucket (hilgendorf-misc-data) tags: error listing resource tags (hilgendorf-misc-data): AccessDenied: Access Denied status code: 403, request id: TR6J0XR2TT65SF3N, host id: 53e1UhXXF/V7BXwyudSim+1LG895eIc0dL2+5RDVA7lRdjmxzuzyKDb7eCGCgFlGGEMNHGOBwsM=
with aws<sub>s3</sub><sub>bucket.misc</sub>-data
on s3.tf line 1, in resource &ldquo;aws<sub>s3</sub><sub>bucket</sub>&rdquo; &ldquo;misc-data&rdquo;:
</p>

<p>
resource &ldquo;aws<sub>s3</sub><sub>bucket</sub>&rdquo; &ldquo;misc-data&rdquo; {
</p></li>
<li>Issue was due to <b>IAM</b>, policy updated <a href="#-configure-aws-create-iam-user-and-policies-">Create IAM User and Policies</a> but need to further refine. This worked after giving <code>"s3:*"</code> to <code>terraform-user</code></li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org5cbfaa9" class="outline-3">
<h3 id="org5cbfaa9"><span class="section-number-3">6.7</span> Create EFS&#xa0;&#xa0;&#xa0;<span class="tag"><span class="efs">efs</span></span></h3>
<div class="outline-text-3" id="text-6-7">
</div>
<div id="outline-container-org54d1ffc" class="outline-4">
<h4 id="org54d1ffc"><span class="section-number-4">6.7.1</span> <a href="./terraform/efs.tf">./terraform/efs.tf</a></h4>
<div class="outline-text-4" id="text-6-7-1">
<div class="org-src-container">
<pre class="src src-json">resource <span style="color: #98be65;">"aws_efs_file_system"</span> <span style="color: #98be65;">"dev"</span> {
  creation_token = <span style="color: #98be65;">"dev-volume"</span>
  provider  = aws.region-master
  tags = {
    Name = <span style="color: #98be65;">"keys"</span>
  }
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container--create-infrastructure-with-terraform-ecs-for-awx-" class="outline-3">
<h3 id="-create-infrastructure-with-terraform-ecs-for-awx-"><span class="section-number-3">6.8</span> ECS for AWX&#xa0;&#xa0;&#xa0;<span class="tag"><span class="awx">awx</span>&#xa0;<span class="ecs">ecs</span></span></h3>
<div class="outline-text-3" id="text--create-infrastructure-with-terraform-ecs-for-awx-">
<ul class="org-ul">
<li>An Amazon ECS service allows you to run and maintain a specified number of instances of a task definition simultaneously in an Amazon ECS cluster. If any of your tasks should fail or stop for any reason, the Amazon ECS service scheduler launches another instance of your task definition to replace it in order to maintain the desired number of tasks in the service.</li>
</ul>
<p>
:CUSTOM<sub>ID</sub>: -create-infrastructure-with-terraform-ecs-for-awx-
</p>
</div>
<div id="outline-container-org78580b2" class="outline-4">
<h4 id="org78580b2"><span class="section-number-4">6.8.1</span> <a href="./terraform/ecs.tf">./terraform/ecs.tf</a></h4>
<div class="outline-text-4" id="text-6-8-1">
<div class="org-src-container">
<pre class="src src-json">
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org3bec491" class="outline-3">
<h3 id="org3bec491"><span class="section-number-3">6.9</span> Create Outputs&#xa0;&#xa0;&#xa0;<span class="tag"><span class="output">output</span></span></h3>
<div class="outline-text-3" id="text-6-9">
</div>
<div id="outline-container-orgddeaf1d" class="outline-4">
<h4 id="orgddeaf1d"><span class="section-number-4">6.9.1</span> <a href="./terraform/outputs.tf">./terraform/outputs.tf</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="outputs">outputs</span></span></h4>
<div class="outline-text-4" id="text-6-9-1">
<div class="org-src-container">
<pre class="src src-json">output <span style="color: #98be65;">"Devops-Main-Node-Public-IP"</span> {
  value = aws_instance.devops-master.public_ip
}

output <span style="color: #98be65;">"Devops-Worker-Public-IPs"</span> {
  value = {
    for instance in aws_instance.devops-worker-oregon :
    instance.id =&gt; instance.public_ip
  }
}
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-org413d071" class="outline-2">
<h2 id="org413d071"><span class="section-number-2">7</span> Bootstrap EC2 with cloud-init&#xa0;&#xa0;&#xa0;<span class="tag"><span class="cloud_init">cloud_init</span></span></h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li><a href="https://cloudinit.readthedocs.io/en/latest/">https://cloudinit.readthedocs.io/en/latest/</a></li>
<li><a href="https://cloudinit.readthedocs.io/en/latest/topics/examples.html">https://cloudinit.readthedocs.io/en/latest/topics/examples.html</a></li>
</ul>
</div>
<div id="outline-container-orgd40da37" class="outline-3">
<h3 id="orgd40da37"><span class="section-number-3">7.1</span> <a href="./terraform/scripts/cloud-init.yaml">./terraform/scripts/cloud-init.yaml</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="cloudinit">cloudinit</span>&#xa0;<span class="script">script</span></span></h3>
<div class="outline-text-3" id="text-7-1">
<ul class="org-ul">
<li>install software</li>
<li>create users</li>
<li>jenkins-master will also be ansible master</li>
<li>create ssh key</li>
<li>copy it to ec2-user known keys</li>
</ul>
<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #5B6268;">#</span><span style="color: #5B6268;">cloud-config</span>
<span style="color: #dcaeea;">package_update</span>: <span style="color: #a9a1e1;">true</span>
<span style="color: #dcaeea;">package_upgrade</span>: <span style="color: #a9a1e1;">true</span>
<span style="color: #dcaeea;">packages</span>:
  - awscli
  - tmux
  - ansible
  - git
  - python3
  - python3-pip
  - python-boto3
<span style="color: #dcaeea;">runcmd</span>:
  - aws --version
  - echo <span style="color: #98be65;">"cathead-biscuit"</span>
  - yum update -y
  - amazon-linux-extras install ansible2
  - ansible --version
  - git clone https://github.com/edhilgendorf/ansible-cloud.git
  - pip3 install boto3
  - sudo mkdir -p /opt/ansible/inventory
</pre>
</div>
</div>
</div>
<div id="outline-container-org1049a0d" class="outline-3">
<h3 id="org1049a0d"><span class="section-number-3">7.2</span> <a href="./terraform/scripts/cloud-init.yaml">./terraform/scripts/cloud-init.yaml</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="cloudinit">cloudinit</span>&#xa0;<span class="script">script</span></span></h3>
<div class="outline-text-3" id="text-7-2">
<ul class="org-ul">
<li>We need to get public SSH keys synced from master. Current plan is to add IAM (<a href="#orge72d2a5">Create IAM Role for EC2 Access</a>) roles to the EC2 instances so they can add and download keys via AWS CLI (<a href="#org4255609">Use AWS CLI</a>)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org40fa15b" class="outline-2">
<h2 id="org40fa15b"><span class="section-number-2">8</span> Configuration Management with Ansible&#xa0;&#xa0;&#xa0;<span class="tag"><span class="ansible">ansible</span></span></h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li>This will be focused on a new repository: <a href="https://github.com/edhilgendorf/ansible-cloud.git">ansible-cloud</a></li>
<li>From here we will provision all agent EC2 instances created in <a href="#-create-infrastructure-with-terraform-">Create Infrastructure with Terraform</a> with Ansible, starting with Jenkins</li>
</ul>
</div>
<div id="outline-container-orgc902780" class="outline-3">
<h3 id="orgc902780"><span class="section-number-3">8.1</span> <del>Getting AWS Credentials to Ansible</del> This is best configured by attaching a role to the EC2 instance, done here: <a href="#orge72d2a5">Create IAM Role for EC2 Access</a></h3>
<div class="outline-text-3" id="text-8-1">
<ul class="org-ul">
<li>Local AWS access via <a href="https://aws.amazon.com/cli/">AWS CLI</a> must be configured prior to this point, so we are going to leverage those credentials to get them into place on the EC2 server so we are able to build and maintain our <a href="#org187efda">Dynamic Inventory</a>.</li>
<li>To do this we will need to run a local script, <b>after</b> Terraform provisioning is complete.</li>
</ul>
</div>
<div id="outline-container-orgbc4eb52" class="outline-4">
<h4 id="orgbc4eb52"><span class="section-number-4">8.1.1</span> <a href="./terraform/sync-aws-creds.sh">./terraform/sync-aws-creds.sh</a></h4>
<div class="outline-text-4" id="text-8-1-1">
<div class="org-src-container">
<pre class="src src-json">rsync -vaP ~/.aws/credentials ec<span style="color: #a9a1e1;">2</span>-user@$(terraform output -json | jq  -r '.<span style="color: #98be65;">"Jenkins-Main-Node-Public-IP"</span>.<span style="color: #98be65;">"value"</span>'):/tmp/credentials
</pre>
</div>
</div>
</div>
</div>
