readme.org
** Dynamic Inventory :dynamic_inventory:
https://aws.amazon.com/blogs/apn/getting-started-with-ansible-and-dynamic-amazon-ec2-inventory-management/
*** [[../ansible-cloud/ansible.cfg]]
- enable the aws_ec2 plugin
- set the inventory file to our dynamic inventory
- set remote_user
:PROPERTIES:
:header-args: :tangle ../ansible-cloud/ansible.cfg
:END:
#+begin_src
[inventory]
enable_plugins = aws_ec2
[defaults]
inventory = /ansible-cloud/ansible-inventory.yml
#+end_src
*** [[../ansible-cloud/aws_ec2.yml]]
:PROPERTIES:
:header-args: :tangle ../ansible-cloud/aws_ec2.yml
:END:
#+begin_src yml
---
plugin: aws_ec2
keyed_groups:
  - key: tags
    prefix: tag
#+end_src
** AWX :awx:
:PROPERTIES:
:CUSTOM_ID: -configuration-management-with-ansible-awx-
:END:
* IAM Terraform User _end_ :policy_end:
:PROPERTIES:
:CUSTOM_ID: -iam-terraform-user--end--
:END:
** [[./terraform/policies/terraform_user.json]]
:PROPERTIES:
:header-args: :tangle terraform/policies/terraform_user.json
:END:
#+begin_src json
      ],
      "Effect": "Allow",
      "Resource": "*"
    }
  ]
}
#+end_src
* Useful Commands
- ~taint~: taint a resource to be replaced. This might be useful to retest a cloud-init script without recreating all of your infrastructure.
  + ex: ~terraform taint aws_instance.jenkins-master~
- execute a remote command to your EC2 instance
  #+begin_src sh
ssh -o StrictHostKeyChecking=no ec2-user@$(terraform output -json | jq  -r '."Devops-Main-Node-Public-IP"."value"') "sudo grep 'cathead' /var/log/cloud-init-output.log"
  #+end_src
- ssh to your EC2 instance
  #+begin_src sh
ssh -o StrictHostKeyChecking=no ec2-user@$(terraform output -json | jq  -r '."Devops-Main-Node-Public-IP"."value"')
  #+end_src
- get IP of an instance
  #+begin_src sh
terraform output -json | jq  -r '."Devops-Main-Node-Public-IP"."value"'
  #+end_src
* Troubleshooting :troubleshooting:
** Encoded Messages :sts:error:
- You can get an error message from AWS, in Terraform output in an encoded message. You can decode this on the CLI:
  + note: may need to apply ~sts:~ to your user's role to view the contents.
#+begin_src bash
aws sts decode-authorization-message --encoded-message "<your message here>"
#+end_src
** Unrelated Errors :error:region:
- While creating and attaching the EC2 Role's I was repeatedly getting an error saying "Region must be set". I troubleshot this for days until I finally realized what was really happening -- The Terraform user (part of IAM) did not have permission to create IAM roles. After updating that role the region error disappeared. Always check your policy when adding new resources to ensure it is allowed and prevent wasting time.
