index.html
<div id="outline-container-org187efda" class="outline-3">
<h3 id="org187efda"><span class="section-number-3">8.2</span> Dynamic Inventory&#xa0;&#xa0;&#xa0;<span class="tag"><span class="dynamic_inventory">dynamic_inventory</span></span></h3>
<div class="outline-text-3" id="text-8-2">
<p>
<a href="https://aws.amazon.com/blogs/apn/getting-started-with-ansible-and-dynamic-amazon-ec2-inventory-management/">https://aws.amazon.com/blogs/apn/getting-started-with-ansible-and-dynamic-amazon-ec2-inventory-management/</a>
</p>
</div>
<div id="outline-container-orga0eb763" class="outline-4">
<h4 id="orga0eb763"><span class="section-number-4">8.2.1</span> <a href="../ansible-cloud/ansible.cfg">../ansible-cloud/ansible.cfg</a></h4>
<div class="outline-text-4" id="text-8-2-1">
<ul class="org-ul">
<li>enable the aws<sub>ec2</sub> plugin</li>
<li>set the inventory file to our dynamic inventory</li>
<li>set remote<sub>user</sub></li>
</ul>
<p>
:header-args: :tangle ../ansible-cloud/ansible.cfg
</p>
<pre class="example">
[inventory]
enable_plugins = aws_ec2
[defaults]
inventory = /ansible-cloud/ansible-inventory.yml
</pre>
</div>
</div>
<div id="outline-container-org0ab71f4" class="outline-4">
<h4 id="org0ab71f4"><span class="section-number-4">8.2.2</span> <a href="../ansible-cloud/aws_ec2.yml">../ansible-cloud/aws_ec2.yml</a></h4>
<div class="outline-text-4" id="text-8-2-2">
<div class="org-src-container">
<pre class="src src-yml">---
plugin: aws_ec2
keyed_groups:
  - key: tags
    prefix: tag
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container--iam-terraform-user--end--" class="outline-2">
<h2 id="-iam-terraform-user--end--"><span class="section-number-2">9</span> IAM Terraform User <span class="underline">end</span>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="policy_end">policy_end</span></span></h2>
<div class="outline-text-2" id="text--iam-terraform-user--end--">
<p>
<a href="./terraform/policies/terraform_user.json">./terraform/policies/terraform_user.json</a>
</p>
<div class="org-src-container">
<pre class="src src-json">      ],
      <span style="color: #51afef;">"Effect"</span>: <span style="color: #98be65;">"Allow"</span>,
      <span style="color: #51afef;">"Resource"</span>: <span style="color: #98be65;">"*"</span>
    }
  ]
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org8e84a1a" class="outline-2">
<h2 id="org8e84a1a"><span class="section-number-2">10</span> Useful Commands</h2>
<div class="outline-text-2" id="text-10">
<ul class="org-ul">
<li><code>taint</code>: taint a resource to be replaced. This might be useful to retest a cloud-init script without recreating all of your infrastructure.
<ul class="org-ul">
<li>ex: <code>terraform taint aws_instance.jenkins-master</code></li>
</ul></li>
<li><p>
execute a remote command to your EC2 instance
</p>
<div class="org-src-container">
<pre class="src src-sh">ssh -o <span style="color: #dcaeea;">StrictHostKeyChecking</span>=no ec2-user@$<span style="color: #51afef;">(</span><span style="color: #51afef; font-weight: bold;">terraform</span> output -json | jq  -r <span style="color: #98be65;">'."Devops-Main-Node-Public-IP"."value"'</span><span style="color: #51afef;">)</span> <span style="color: #98be65;">"</span><span style="color: #98be65;">sudo</span><span style="color: #98be65;"> </span><span style="color: #98be65;">grep</span><span style="color: #98be65;"> 'cathead' /var/log/cloud-init-output.log"</span>
</pre>
</div></li>
<li><p>
ssh to your EC2 instance
</p>
<div class="org-src-container">
<pre class="src src-sh">ssh -o <span style="color: #dcaeea;">StrictHostKeyChecking</span>=no ec2-user@$<span style="color: #51afef;">(</span><span style="color: #51afef; font-weight: bold;">terraform</span> output -json | jq  -r <span style="color: #98be65;">'."Devops-Main-Node-Public-IP"."value"'</span><span style="color: #51afef;">)</span>
</pre>
</div></li>
<li><p>
get IP of an instance
</p>
<div class="org-src-container">
<pre class="src src-sh">terraform output -json | jq  -r <span style="color: #98be65;">'."Devops-Main-Node-Public-IP"."value"'</span>
</pre>
</div></li>
</ul>
</div>
</div>
<div id="outline-container-org0aa524b" class="outline-2">
<h2 id="org0aa524b"><span class="section-number-2">11</span> Troubleshooting&#xa0;&#xa0;&#xa0;<span class="tag"><span class="troubleshooting">troubleshooting</span></span></h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-org1d729cc" class="outline-3">
<h3 id="org1d729cc"><span class="section-number-3">11.1</span> Encoded Messages&#xa0;&#xa0;&#xa0;<span class="tag"><span class="sts">sts</span>&#xa0;<span class="error">error</span></span></h3>
<div class="outline-text-3" id="text-11-1">
<ul class="org-ul">
<li>You can get an error message from AWS, in Terraform output in an encoded message. You can decode this on the CLI:
<ul class="org-ul">
<li>note: may need to apply <code>sts:</code> to your user&rsquo;s role to view the contents.</li>
</ul></li>
</ul>
<div class="org-src-container">
<pre class="src src-bash">aws sts decode-authorization-message --encoded-message <span style="color: #98be65;">"&lt;your message here&gt;"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org9f96f6e" class="outline-3">
<h3 id="org9f96f6e"><span class="section-number-3">11.2</span> Unrelated Errors&#xa0;&#xa0;&#xa0;<span class="tag"><span class="error">error</span>&#xa0;<span class="region">region</span></span></h3>
<div class="outline-text-3" id="text-11-2">
<ul class="org-ul">
<li>While creating and attaching the EC2 Role&rsquo;s I was repeatedly getting an error saying &ldquo;Region must be set&rdquo;. I troubleshot this for days until I finally realized what was really happening &#x2013; The Terraform user (part of IAM) did not have permission to create IAM roles. After updating that role the region error disappeared. Always check your policy when adding new resources to ensure it is allowed and prevent wasting time.</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: edward</p>
<p class="date">Created: 2021-10-12 Tue 16:12</p>
</div>
</body>
</html>
